keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCif_bf.h
/** \\brief  Mask for Ifx_CIF_IRCL_Bits.CIF_ISP_SOFT_RST */
#define IFX_CIF_IRCL_CIF_ISP_SOFT_RST_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_IRCL_Bits.CIF_ISP_SOFT_RST */
#define IFX_CIF_IRCL_CIF_ISP_SOFT_RST_OFF (0)

/** \\brief  Length for Ifx_CIF_IRCL_Bits.CIF_JPEG_SOFT_RST */
#define IFX_CIF_IRCL_CIF_JPEG_SOFT_RST_LEN (1)

/** \\brief  Mask for Ifx_CIF_IRCL_Bits.CIF_JPEG_SOFT_RST */
#define IFX_CIF_IRCL_CIF_JPEG_SOFT_RST_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_IRCL_Bits.CIF_JPEG_SOFT_RST */
#define IFX_CIF_IRCL_CIF_JPEG_SOFT_RST_OFF (5)

/** \\brief  Length for Ifx_CIF_IRCL_Bits.CIF_LIN_DSCALER_RST */
#define IFX_CIF_IRCL_CIF_LIN_DSCALER_RST_LEN (1)

/** \\brief  Mask for Ifx_CIF_IRCL_Bits.CIF_LIN_DSCALER_RST */
#define IFX_CIF_IRCL_CIF_LIN_DSCALER_RST_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_IRCL_Bits.CIF_LIN_DSCALER_RST */
#define IFX_CIF_IRCL_CIF_LIN_DSCALER_RST_OFF (17)

/** \\brief  Length for Ifx_CIF_IRCL_Bits.CIF_MI_SOFT_RST */
#define IFX_CIF_IRCL_CIF_MI_SOFT_RST_LEN (1)

/** \\brief  Mask for Ifx_CIF_IRCL_Bits.CIF_MI_SOFT_RST */
#define IFX_CIF_IRCL_CIF_MI_SOFT_RST_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_IRCL_Bits.CIF_MI_SOFT_RST */
#define IFX_CIF_IRCL_CIF_MI_SOFT_RST_OFF (6)

/** \\brief  Length for Ifx_CIF_IRCL_Bits.CIF_WATCHDOG_RST */
#define IFX_CIF_IRCL_CIF_WATCHDOG_RST_LEN (1)

/** \\brief  Mask for Ifx_CIF_IRCL_Bits.CIF_WATCHDOG_RST */
#define IFX_CIF_IRCL_CIF_WATCHDOG_RST_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_IRCL_Bits.CIF_WATCHDOG_RST */
#define IFX_CIF_IRCL_CIF_WATCHDOG_RST_OFF (16)

/** \\brief  Length for Ifx_CIF_IRCL_Bits.CIF_YCS_SOFT_RST */
#define IFX_CIF_IRCL_CIF_YCS_SOFT_RST_LEN (1)

/** \\brief  Mask for Ifx_CIF_IRCL_Bits.CIF_YCS_SOFT_RST */
#define IFX_CIF_IRCL_CIF_YCS_SOFT_RST_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_IRCL_Bits.CIF_YCS_SOFT_RST */
#define IFX_CIF_IRCL_CIF_YCS_SOFT_RST_OFF (2)

/** \\brief  Length for Ifx_CIF_ISP_ACQ_H_OFFS_Bits.ACQ_H_OFFS */
#define IFX_CIF_ISP_ACQ_H_OFFS_ACQ_H_OFFS_LEN (13)

/** \\brief  Mask for Ifx_CIF_ISP_ACQ_H_OFFS_Bits.ACQ_H_OFFS */
#define IFX_CIF_ISP_ACQ_H_OFFS_ACQ_H_OFFS_MSK (0x1fff)

/** \\brief  Offset for Ifx_CIF_ISP_ACQ_H_OFFS_Bits.ACQ_H_OFFS */
#define IFX_CIF_ISP_ACQ_H_OFFS_ACQ_H_OFFS_OFF (0)

/** \\brief  Length for Ifx_CIF_ISP_ACQ_H_SIZE_Bits.ACQ_H_SIZE */
#define IFX_CIF_ISP_ACQ_H_SIZE_ACQ_H_SIZE_LEN (13)

/** \\brief  Mask for Ifx_CIF_ISP_ACQ_H_SIZE_Bits.ACQ_H_SIZE */
#define IFX_CIF_ISP_ACQ_H_SIZE_ACQ_H_SIZE_MSK (0x1fff)

/** \\brief  Offset for Ifx_CIF_ISP_ACQ_H_SIZE_Bits.ACQ_H_SIZE */
#define IFX_CIF_ISP_ACQ_H_SIZE_ACQ_H_SIZE_OFF (0)

/** \\brief  Length for Ifx_CIF_ISP_ACQ_NR_FRAMES_Bits.ACQ_NR_FRAMES */
#define IFX_CIF_ISP_ACQ_NR_FRAMES_ACQ_NR_FRAMES_LEN (10)

/** \\brief  Mask for Ifx_CIF_ISP_ACQ_NR_FRAMES_Bits.ACQ_NR_FRAMES */
#define IFX_CIF_ISP_ACQ_NR_FRAMES_ACQ_NR_FRAMES_MSK (0x3ff)

/** \\brief  Offset for Ifx_CIF_ISP_ACQ_NR_FRAMES_Bits.ACQ_NR_FRAMES */
#define IFX_CIF_ISP_ACQ_NR_FRAMES_ACQ_NR_FRAMES_OFF (0)

/** \\brief  Length for Ifx_CIF_ISP_ACQ_PROP_Bits.CCIR_SEQ */
#define IFX_CIF_ISP_ACQ_PROP_CCIR_SEQ_LEN (2)

/** \\brief  Mask for Ifx_CIF_ISP_ACQ_PROP_Bits.CCIR_SEQ */
#define IFX_CIF_ISP_ACQ_PROP_CCIR_SEQ_MSK (0x3)

/** \\brief  Offset for Ifx_CIF_ISP_ACQ_PROP_Bits.CCIR_SEQ */
#define IFX_CIF_ISP_ACQ_PROP_CCIR_SEQ_OFF (7)

/** \\brief  Length for Ifx_CIF_ISP_ACQ_PROP_Bits.FIELD_INVERT */
#define IFX_CIF_ISP_ACQ_PROP_FIELD_INVERT_LEN (1)

/** \\brief  Mask for Ifx_CIF_ISP_ACQ_PROP_Bits.FIELD_INVERT */
#define IFX_CIF_ISP_ACQ_PROP_FIELD_INVERT_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_ISP_ACQ_PROP_Bits.FIELD_INVERT */
#define IFX_CIF_ISP_ACQ_PROP_FIELD_INVERT_OFF (11)

/** \\brief  Length for Ifx_CIF_ISP_ACQ_PROP_Bits.FIELD_SELECTION */
#define IFX_CIF_ISP_ACQ_PROP_FIELD_SELECTION_LEN (2)

/** \\brief  Mask for Ifx_CIF_ISP_ACQ_PROP_Bits.FIELD_SELECTION */
#define IFX_CIF_ISP_ACQ_PROP_FIELD_SELECTION_MSK (0x3)

/** \\brief  Offset for Ifx_CIF_ISP_ACQ_PROP_Bits.FIELD_SELECTION */
#define IFX_CIF_ISP_ACQ_PROP_FIELD_SELECTION_OFF (9)

/** \\brief  Length for Ifx_CIF_ISP_ACQ_PROP_Bits.HSYNC_POL */
#define IFX_CIF_ISP_ACQ_PROP_HSYNC_POL_LEN (1)

/** \\brief  Mask for Ifx_CIF_ISP_ACQ_PROP_Bits.HSYNC_POL */
#define IFX_CIF_ISP_ACQ_PROP_HSYNC_POL_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_ISP_ACQ_PROP_Bits.HSYNC_POL */
#define IFX_CIF_ISP_ACQ_PROP_HSYNC_POL_OFF (1)

/** \\brief  Length for Ifx_CIF_ISP_ACQ_PROP_Bits.INPUT_SELECTION */
#define IFX_CIF_ISP_ACQ_PROP_INPUT_SELECTION_LEN (4)

/** \\brief  Mask for Ifx_CIF_ISP_ACQ_PROP_Bits.INPUT_SELECTION */
#define IFX_CIF_ISP_ACQ_PROP_INPUT_SELECTION_MSK (0xf)

/** \\brief  Length for Ifx_CIF_ISP_ACQ_PROP_Bits.INPUT_SELECTION_NO_APP */
#define IFX_CIF_ISP_ACQ_PROP_INPUT_SELECTION_NO_APP_LEN (1)

/** \\brief  Mask for Ifx_CIF_ISP_ACQ_PROP_Bits.INPUT_SELECTION_NO_APP */
#define IFX_CIF_ISP_ACQ_PROP_INPUT_SELECTION_NO_APP_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_ISP_ACQ_PROP_Bits.INPUT_SELECTION_NO_APP */
#define IFX_CIF_ISP_ACQ_PROP_INPUT_SELECTION_NO_APP_OFF (20)

/** \\brief  Offset for Ifx_CIF_ISP_ACQ_PROP_Bits.INPUT_SELECTION */
#define IFX_CIF_ISP_ACQ_PROP_INPUT_SELECTION_OFF (12)

/** \\brief  Length for Ifx_CIF_ISP_ACQ_PROP_Bits.SAMPLE_EDGE */
#define IFX_CIF_ISP_ACQ_PROP_SAMPLE_EDGE_LEN (1)

/** \\brief  Mask for Ifx_CIF_ISP_ACQ_PROP_Bits.SAMPLE_EDGE */
#define IFX_CIF_ISP_ACQ_PROP_SAMPLE_EDGE_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_ISP_ACQ_PROP_Bits.SAMPLE_EDGE */
#define IFX_CIF_ISP_ACQ_PROP_SAMPLE_EDGE_OFF (0)

/** \\brief  Length for Ifx_CIF_ISP_ACQ_PROP_Bits.VSYNC_POL */
#define IFX_CIF_ISP_ACQ_PROP_VSYNC_POL_LEN (1)

/** \\brief  Mask for Ifx_CIF_ISP_ACQ_PROP_Bits.VSYNC_POL */
#define IFX_CIF_ISP_ACQ_PROP_VSYNC_POL_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_ISP_ACQ_PROP_Bits.VSYNC_POL */
#define IFX_CIF_ISP_ACQ_PROP_VSYNC_POL_OFF (2)

/** \\brief  Length for Ifx_CIF_ISP_ACQ_V_OFFS_Bits.ACQ_V_OFFS */
#define IFX_CIF_ISP_ACQ_V_OFFS_ACQ_V_OFFS_LEN (12)

/** \\brief  Mask for Ifx_CIF_ISP_ACQ_V_OFFS_Bits.ACQ_V_OFFS */
#define IFX_CIF_ISP_ACQ_V_OFFS_ACQ_V_OFFS_MSK (0xfff)

/** \\brief  Offset for Ifx_CIF_ISP_ACQ_V_OFFS_Bits.ACQ_V_OFFS */
#define IFX_CIF_ISP_ACQ_V_OFFS_ACQ_V_OFFS_OFF (0)

/** \\brief  Length for Ifx_CIF_ISP_ACQ_V_SIZE_Bits.ACQ_V_SIZE */
#define IFX_CIF_ISP_ACQ_V_SIZE_ACQ_V_SIZE_LEN (12)

/** \\brief  Mask for Ifx_CIF_ISP_ACQ_V_SIZE_Bits.ACQ_V_SIZE */
#define IFX_CIF_ISP_ACQ_V_SIZE_ACQ_V_SIZE_MSK (0xfff)

/** \\brief  Offset for Ifx_CIF_ISP_ACQ_V_SIZE_Bits.ACQ_V_SIZE */
#define IFX_CIF_ISP_ACQ_V_SIZE_ACQ_V_SIZE_OFF (0)

