keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCif_bf.h
/** \\brief  Length for Ifx_CIF_ISP_CTRL_Bits.ISP_CFG_UPD */
#define IFX_CIF_ISP_CTRL_ISP_CFG_UPD_LEN (1)

/** \\brief  Mask for Ifx_CIF_ISP_CTRL_Bits.ISP_CFG_UPD */
#define IFX_CIF_ISP_CTRL_ISP_CFG_UPD_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_ISP_CTRL_Bits.ISP_CFG_UPD */
#define IFX_CIF_ISP_CTRL_ISP_CFG_UPD_OFF (9)

/** \\brief  Length for Ifx_CIF_ISP_CTRL_Bits.ISP_CSM_C_RANGE */
#define IFX_CIF_ISP_CTRL_ISP_CSM_C_RANGE_LEN (1)

/** \\brief  Mask for Ifx_CIF_ISP_CTRL_Bits.ISP_CSM_C_RANGE */
#define IFX_CIF_ISP_CTRL_ISP_CSM_C_RANGE_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_ISP_CTRL_Bits.ISP_CSM_C_RANGE */
#define IFX_CIF_ISP_CTRL_ISP_CSM_C_RANGE_OFF (14)

/** \\brief  Length for Ifx_CIF_ISP_CTRL_Bits.ISP_CSM_Y_RANGE */
#define IFX_CIF_ISP_CTRL_ISP_CSM_Y_RANGE_LEN (1)

/** \\brief  Mask for Ifx_CIF_ISP_CTRL_Bits.ISP_CSM_Y_RANGE */
#define IFX_CIF_ISP_CTRL_ISP_CSM_Y_RANGE_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_ISP_CTRL_Bits.ISP_CSM_Y_RANGE */
#define IFX_CIF_ISP_CTRL_ISP_CSM_Y_RANGE_OFF (13)

/** \\brief  Length for Ifx_CIF_ISP_CTRL_Bits.ISP_ENABLE */
#define IFX_CIF_ISP_CTRL_ISP_ENABLE_LEN (1)

/** \\brief  Mask for Ifx_CIF_ISP_CTRL_Bits.ISP_ENABLE */
#define IFX_CIF_ISP_CTRL_ISP_ENABLE_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_ISP_CTRL_Bits.ISP_ENABLE */
#define IFX_CIF_ISP_CTRL_ISP_ENABLE_OFF (0)

/** \\brief  Length for Ifx_CIF_ISP_CTRL_Bits.ISP_GEN_CFG_UPD */
#define IFX_CIF_ISP_CTRL_ISP_GEN_CFG_UPD_LEN (1)

/** \\brief  Mask for Ifx_CIF_ISP_CTRL_Bits.ISP_GEN_CFG_UPD */
#define IFX_CIF_ISP_CTRL_ISP_GEN_CFG_UPD_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_ISP_CTRL_Bits.ISP_GEN_CFG_UPD */
#define IFX_CIF_ISP_CTRL_ISP_GEN_CFG_UPD_OFF (10)

/** \\brief  Length for Ifx_CIF_ISP_CTRL_Bits.ISP_INFORM_ENABLE */
#define IFX_CIF_ISP_CTRL_ISP_INFORM_ENABLE_LEN (1)

/** \\brief  Mask for Ifx_CIF_ISP_CTRL_Bits.ISP_INFORM_ENABLE */
#define IFX_CIF_ISP_CTRL_ISP_INFORM_ENABLE_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_ISP_CTRL_Bits.ISP_INFORM_ENABLE */
#define IFX_CIF_ISP_CTRL_ISP_INFORM_ENABLE_OFF (4)

/** \\brief  Length for Ifx_CIF_ISP_CTRL_Bits.ISP_MODE */
#define IFX_CIF_ISP_CTRL_ISP_MODE_LEN (3)

/** \\brief  Mask for Ifx_CIF_ISP_CTRL_Bits.ISP_MODE */
#define IFX_CIF_ISP_CTRL_ISP_MODE_MSK (0x7)

/** \\brief  Offset for Ifx_CIF_ISP_CTRL_Bits.ISP_MODE */
#define IFX_CIF_ISP_CTRL_ISP_MODE_OFF (1)

/** \\brief  Length for Ifx_CIF_ISP_ERR_CLR_Bits.INFORM_SIZE_ERR_CLR */
#define IFX_CIF_ISP_ERR_CLR_INFORM_SIZE_ERR_CLR_LEN (1)

/** \\brief  Mask for Ifx_CIF_ISP_ERR_CLR_Bits.INFORM_SIZE_ERR_CLR */
#define IFX_CIF_ISP_ERR_CLR_INFORM_SIZE_ERR_CLR_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_ISP_ERR_CLR_Bits.INFORM_SIZE_ERR_CLR */
#define IFX_CIF_ISP_ERR_CLR_INFORM_SIZE_ERR_CLR_OFF (0)

/** \\brief  Length for Ifx_CIF_ISP_ERR_CLR_Bits.IS_SIZE_ERR_CLR */
#define IFX_CIF_ISP_ERR_CLR_IS_SIZE_ERR_CLR_LEN (1)

/** \\brief  Mask for Ifx_CIF_ISP_ERR_CLR_Bits.IS_SIZE_ERR_CLR */
#define IFX_CIF_ISP_ERR_CLR_IS_SIZE_ERR_CLR_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_ISP_ERR_CLR_Bits.IS_SIZE_ERR_CLR */
#define IFX_CIF_ISP_ERR_CLR_IS_SIZE_ERR_CLR_OFF (1)

/** \\brief  Length for Ifx_CIF_ISP_ERR_CLR_Bits.OUTFORM_SIZE_ERR_CLR */
#define IFX_CIF_ISP_ERR_CLR_OUTFORM_SIZE_ERR_CLR_LEN (1)

/** \\brief  Mask for Ifx_CIF_ISP_ERR_CLR_Bits.OUTFORM_SIZE_ERR_CLR */
#define IFX_CIF_ISP_ERR_CLR_OUTFORM_SIZE_ERR_CLR_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_ISP_ERR_CLR_Bits.OUTFORM_SIZE_ERR_CLR */
#define IFX_CIF_ISP_ERR_CLR_OUTFORM_SIZE_ERR_CLR_OFF (2)

/** \\brief  Length for Ifx_CIF_ISP_ERR_Bits.INFORM_SIZE_ERR */
#define IFX_CIF_ISP_ERR_INFORM_SIZE_ERR_LEN (1)

/** \\brief  Mask for Ifx_CIF_ISP_ERR_Bits.INFORM_SIZE_ERR */
#define IFX_CIF_ISP_ERR_INFORM_SIZE_ERR_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_ISP_ERR_Bits.INFORM_SIZE_ERR */
#define IFX_CIF_ISP_ERR_INFORM_SIZE_ERR_OFF (0)

/** \\brief  Length for Ifx_CIF_ISP_ERR_Bits.IS_SIZE_ERR */
#define IFX_CIF_ISP_ERR_IS_SIZE_ERR_LEN (1)

/** \\brief  Mask for Ifx_CIF_ISP_ERR_Bits.IS_SIZE_ERR */
#define IFX_CIF_ISP_ERR_IS_SIZE_ERR_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_ISP_ERR_Bits.IS_SIZE_ERR */
#define IFX_CIF_ISP_ERR_IS_SIZE_ERR_OFF (1)

/** \\brief  Length for Ifx_CIF_ISP_ERR_Bits.OUTFORM_SIZE_ERR */
#define IFX_CIF_ISP_ERR_OUTFORM_SIZE_ERR_LEN (1)

/** \\brief  Mask for Ifx_CIF_ISP_ERR_Bits.OUTFORM_SIZE_ERR */
#define IFX_CIF_ISP_ERR_OUTFORM_SIZE_ERR_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_ISP_ERR_Bits.OUTFORM_SIZE_ERR */
#define IFX_CIF_ISP_ERR_OUTFORM_SIZE_ERR_OFF (2)

/** \\brief  Length for Ifx_CIF_ISP_FLAGS_SHD_Bits.INFORM_FIELD */
#define IFX_CIF_ISP_FLAGS_SHD_INFORM_FIELD_LEN (1)

/** \\brief  Mask for Ifx_CIF_ISP_FLAGS_SHD_Bits.INFORM_FIELD */
#define IFX_CIF_ISP_FLAGS_SHD_INFORM_FIELD_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_ISP_FLAGS_SHD_Bits.INFORM_FIELD */
#define IFX_CIF_ISP_FLAGS_SHD_INFORM_FIELD_OFF (2)

/** \\brief  Length for Ifx_CIF_ISP_FLAGS_SHD_Bits.ISP_ENABLE_SHD */
#define IFX_CIF_ISP_FLAGS_SHD_ISP_ENABLE_SHD_LEN (1)

/** \\brief  Mask for Ifx_CIF_ISP_FLAGS_SHD_Bits.ISP_ENABLE_SHD */
#define IFX_CIF_ISP_FLAGS_SHD_ISP_ENABLE_SHD_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_ISP_FLAGS_SHD_Bits.ISP_ENABLE_SHD */
#define IFX_CIF_ISP_FLAGS_SHD_ISP_ENABLE_SHD_OFF (0)

/** \\brief  Length for Ifx_CIF_ISP_FLAGS_SHD_Bits.ISP_INFORM_ENABLE_SHD */
#define IFX_CIF_ISP_FLAGS_SHD_ISP_INFORM_ENABLE_SHD_LEN (1)

/** \\brief  Mask for Ifx_CIF_ISP_FLAGS_SHD_Bits.ISP_INFORM_ENABLE_SHD */
#define IFX_CIF_ISP_FLAGS_SHD_ISP_INFORM_ENABLE_SHD_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_ISP_FLAGS_SHD_Bits.ISP_INFORM_ENABLE_SHD */
#define IFX_CIF_ISP_FLAGS_SHD_ISP_INFORM_ENABLE_SHD_OFF (1)

/** \\brief  Length for Ifx_CIF_ISP_FLAGS_SHD_Bits.S_DATA */
#define IFX_CIF_ISP_FLAGS_SHD_S_DATA_LEN (16)

/** \\brief  Mask for Ifx_CIF_ISP_FLAGS_SHD_Bits.S_DATA */
#define IFX_CIF_ISP_FLAGS_SHD_S_DATA_MSK (0xffff)

/** \\brief  Offset for Ifx_CIF_ISP_FLAGS_SHD_Bits.S_DATA */
#define IFX_CIF_ISP_FLAGS_SHD_S_DATA_OFF (14)

/** \\brief  Length for Ifx_CIF_ISP_FLAGS_SHD_Bits.S_HSYNC */
#define IFX_CIF_ISP_FLAGS_SHD_S_HSYNC_LEN (1)

/** \\brief  Mask for Ifx_CIF_ISP_FLAGS_SHD_Bits.S_HSYNC */
#define IFX_CIF_ISP_FLAGS_SHD_S_HSYNC_MSK (0x1)

