keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCif_bf.h
/** \\brief  Offset for Ifx_CIF_ISP_OUT_H_SIZE_SHD_Bits.ISP_OUT_H_SIZE_SHD */
#define IFX_CIF_ISP_OUT_H_SIZE_SHD_ISP_OUT_H_SIZE_SHD_OFF (0)

/** \\brief  Length for Ifx_CIF_ISP_OUT_V_OFFS_Bits.ISP_OUT_V_OFFS */
#define IFX_CIF_ISP_OUT_V_OFFS_ISP_OUT_V_OFFS_LEN (12)

/** \\brief  Mask for Ifx_CIF_ISP_OUT_V_OFFS_Bits.ISP_OUT_V_OFFS */
#define IFX_CIF_ISP_OUT_V_OFFS_ISP_OUT_V_OFFS_MSK (0xfff)

/** \\brief  Offset for Ifx_CIF_ISP_OUT_V_OFFS_Bits.ISP_OUT_V_OFFS */
#define IFX_CIF_ISP_OUT_V_OFFS_ISP_OUT_V_OFFS_OFF (0)

/** \\brief  Length for Ifx_CIF_ISP_OUT_V_OFFS_SHD_Bits.ISP_OUT_V_OFFS_SHD */
#define IFX_CIF_ISP_OUT_V_OFFS_SHD_ISP_OUT_V_OFFS_SHD_LEN (12)

/** \\brief  Mask for Ifx_CIF_ISP_OUT_V_OFFS_SHD_Bits.ISP_OUT_V_OFFS_SHD */
#define IFX_CIF_ISP_OUT_V_OFFS_SHD_ISP_OUT_V_OFFS_SHD_MSK (0xfff)

/** \\brief  Offset for Ifx_CIF_ISP_OUT_V_OFFS_SHD_Bits.ISP_OUT_V_OFFS_SHD */
#define IFX_CIF_ISP_OUT_V_OFFS_SHD_ISP_OUT_V_OFFS_SHD_OFF (0)

/** \\brief  Length for Ifx_CIF_ISP_OUT_V_SIZE_Bits.ISP_OUT_V_SIZE */
#define IFX_CIF_ISP_OUT_V_SIZE_ISP_OUT_V_SIZE_LEN (12)

/** \\brief  Mask for Ifx_CIF_ISP_OUT_V_SIZE_Bits.ISP_OUT_V_SIZE */
#define IFX_CIF_ISP_OUT_V_SIZE_ISP_OUT_V_SIZE_MSK (0xfff)

/** \\brief  Offset for Ifx_CIF_ISP_OUT_V_SIZE_Bits.ISP_OUT_V_SIZE */
#define IFX_CIF_ISP_OUT_V_SIZE_ISP_OUT_V_SIZE_OFF (0)

/** \\brief  Length for Ifx_CIF_ISP_OUT_V_SIZE_SHD_Bits.ISP_OUT_V_SIZE_SHD */
#define IFX_CIF_ISP_OUT_V_SIZE_SHD_ISP_OUT_V_SIZE_SHD_LEN (12)

/** \\brief  Mask for Ifx_CIF_ISP_OUT_V_SIZE_SHD_Bits.ISP_OUT_V_SIZE_SHD */
#define IFX_CIF_ISP_OUT_V_SIZE_SHD_ISP_OUT_V_SIZE_SHD_MSK (0xfff)

/** \\brief  Offset for Ifx_CIF_ISP_OUT_V_SIZE_SHD_Bits.ISP_OUT_V_SIZE_SHD */
#define IFX_CIF_ISP_OUT_V_SIZE_SHD_ISP_OUT_V_SIZE_SHD_OFF (0)

/** \\brief  Length for Ifx_CIF_ISP_RIS_Bits.RIS_DATA_LOSS */
#define IFX_CIF_ISP_RIS_RIS_DATA_LOSS_LEN (1)

/** \\brief  Mask for Ifx_CIF_ISP_RIS_Bits.RIS_DATA_LOSS */
#define IFX_CIF_ISP_RIS_RIS_DATA_LOSS_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_ISP_RIS_Bits.RIS_DATA_LOSS */
#define IFX_CIF_ISP_RIS_RIS_DATA_LOSS_OFF (2)

/** \\brief  Length for Ifx_CIF_ISP_RIS_Bits.RIS_FRAME_IN */
#define IFX_CIF_ISP_RIS_RIS_FRAME_IN_LEN (1)

/** \\brief  Mask for Ifx_CIF_ISP_RIS_Bits.RIS_FRAME_IN */
#define IFX_CIF_ISP_RIS_RIS_FRAME_IN_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_ISP_RIS_Bits.RIS_FRAME_IN */
#define IFX_CIF_ISP_RIS_RIS_FRAME_IN_OFF (5)

/** \\brief  Length for Ifx_CIF_ISP_RIS_Bits.RIS_FRAME */
#define IFX_CIF_ISP_RIS_RIS_FRAME_LEN (1)

/** \\brief  Mask for Ifx_CIF_ISP_RIS_Bits.RIS_FRAME */
#define IFX_CIF_ISP_RIS_RIS_FRAME_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_ISP_RIS_Bits.RIS_FRAME */
#define IFX_CIF_ISP_RIS_RIS_FRAME_OFF (1)

/** \\brief  Length for Ifx_CIF_ISP_RIS_Bits.RIS_H_START */
#define IFX_CIF_ISP_RIS_RIS_H_START_LEN (1)

/** \\brief  Mask for Ifx_CIF_ISP_RIS_Bits.RIS_H_START */
#define IFX_CIF_ISP_RIS_RIS_H_START_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_ISP_RIS_Bits.RIS_H_START */
#define IFX_CIF_ISP_RIS_RIS_H_START_OFF (7)

/** \\brief  Length for Ifx_CIF_ISP_RIS_Bits.RIS_ISP_OFF */
#define IFX_CIF_ISP_RIS_RIS_ISP_OFF_LEN (1)

/** \\brief  Mask for Ifx_CIF_ISP_RIS_Bits.RIS_ISP_OFF */
#define IFX_CIF_ISP_RIS_RIS_ISP_OFF_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_ISP_RIS_Bits.RIS_ISP_OFF */
#define IFX_CIF_ISP_RIS_RIS_ISP_OFF_OFF (0)

/** \\brief  Length for Ifx_CIF_ISP_RIS_Bits.RIS_PIC_SIZE_ERR */
#define IFX_CIF_ISP_RIS_RIS_PIC_SIZE_ERR_LEN (1)

/** \\brief  Mask for Ifx_CIF_ISP_RIS_Bits.RIS_PIC_SIZE_ERR */
#define IFX_CIF_ISP_RIS_RIS_PIC_SIZE_ERR_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_ISP_RIS_Bits.RIS_PIC_SIZE_ERR */
#define IFX_CIF_ISP_RIS_RIS_PIC_SIZE_ERR_OFF (3)

/** \\brief  Length for Ifx_CIF_ISP_RIS_Bits.RIS_V_START */
#define IFX_CIF_ISP_RIS_RIS_V_START_LEN (1)

/** \\brief  Mask for Ifx_CIF_ISP_RIS_Bits.RIS_V_START */
#define IFX_CIF_ISP_RIS_RIS_V_START_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_ISP_RIS_Bits.RIS_V_START */
#define IFX_CIF_ISP_RIS_RIS_V_START_OFF (6)

/** \\brief  Length for Ifx_CIF_ISP_RIS_Bits.RIS_WD_TRIG */
#define IFX_CIF_ISP_RIS_RIS_WD_TRIG_LEN (1)

/** \\brief  Mask for Ifx_CIF_ISP_RIS_Bits.RIS_WD_TRIG */
#define IFX_CIF_ISP_RIS_RIS_WD_TRIG_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_ISP_RIS_Bits.RIS_WD_TRIG */
#define IFX_CIF_ISP_RIS_RIS_WD_TRIG_OFF (19)

/** \\brief  Length for Ifx_CIF_ISPIS_CTRL_Bits.IS_EN */
#define IFX_CIF_ISPIS_CTRL_IS_EN_LEN (1)

/** \\brief  Mask for Ifx_CIF_ISPIS_CTRL_Bits.IS_EN */
#define IFX_CIF_ISPIS_CTRL_IS_EN_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_ISPIS_CTRL_Bits.IS_EN */
#define IFX_CIF_ISPIS_CTRL_IS_EN_OFF (0)

/** \\brief  Length for Ifx_CIF_ISPIS_DISPLACE_Bits.DX */
#define IFX_CIF_ISPIS_DISPLACE_DX_LEN (12)

/** \\brief  Mask for Ifx_CIF_ISPIS_DISPLACE_Bits.DX */
#define IFX_CIF_ISPIS_DISPLACE_DX_MSK (0xfff)

/** \\brief  Offset for Ifx_CIF_ISPIS_DISPLACE_Bits.DX */
#define IFX_CIF_ISPIS_DISPLACE_DX_OFF (0)

/** \\brief  Length for Ifx_CIF_ISPIS_DISPLACE_Bits.DY */
#define IFX_CIF_ISPIS_DISPLACE_DY_LEN (12)

/** \\brief  Mask for Ifx_CIF_ISPIS_DISPLACE_Bits.DY */
#define IFX_CIF_ISPIS_DISPLACE_DY_MSK (0xfff)

/** \\brief  Offset for Ifx_CIF_ISPIS_DISPLACE_Bits.DY */
#define IFX_CIF_ISPIS_DISPLACE_DY_OFF (16)

/** \\brief  Length for Ifx_CIF_ISPIS_H_OFFS_Bits.IS_H_OFFS */
#define IFX_CIF_ISPIS_H_OFFS_IS_H_OFFS_LEN (12)

/** \\brief  Mask for Ifx_CIF_ISPIS_H_OFFS_Bits.IS_H_OFFS */
#define IFX_CIF_ISPIS_H_OFFS_IS_H_OFFS_MSK (0xfff)

/** \\brief  Offset for Ifx_CIF_ISPIS_H_OFFS_Bits.IS_H_OFFS */
#define IFX_CIF_ISPIS_H_OFFS_IS_H_OFFS_OFF (0)

/** \\brief  Length for Ifx_CIF_ISPIS_H_OFFS_SHD_Bits.IS_H_OFFS_SHD */
#define IFX_CIF_ISPIS_H_OFFS_SHD_IS_H_OFFS_SHD_LEN (13)

/** \\brief  Mask for Ifx_CIF_ISPIS_H_OFFS_SHD_Bits.IS_H_OFFS_SHD */
#define IFX_CIF_ISPIS_H_OFFS_SHD_IS_H_OFFS_SHD_MSK (0x1fff)

/** \\brief  Offset for Ifx_CIF_ISPIS_H_OFFS_SHD_Bits.IS_H_OFFS_SHD */
#define IFX_CIF_ISPIS_H_OFFS_SHD_IS_H_OFFS_SHD_OFF (0)

/** \\brief  Length for Ifx_CIF_ISPIS_H_SIZE_Bits.IS_H_SIZE */
#define IFX_CIF_ISPIS_H_SIZE_IS_H_SIZE_LEN (12)

/** \\brief  Mask for Ifx_CIF_ISPIS_H_SIZE_Bits.IS_H_SIZE */
#define IFX_CIF_ISPIS_H_SIZE_IS_H_SIZE_MSK (0xfff)

/** \\brief  Offset for Ifx_CIF_ISPIS_H_SIZE_Bits.IS_H_SIZE */
#define IFX_CIF_ISPIS_H_SIZE_IS_H_SIZE_OFF (0)

