keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCif_bf.h
/** \\brief  Mask for Ifx_CIF_JPE_TQ_Y_SELECT_Bits.TQ0_SELECT */
#define IFX_CIF_JPE_TQ_Y_SELECT_TQ0_SELECT_MSK (0x3)

/** \\brief  Offset for Ifx_CIF_JPE_TQ_Y_SELECT_Bits.TQ0_SELECT */
#define IFX_CIF_JPE_TQ_Y_SELECT_TQ0_SELECT_OFF (0)

/** \\brief  Length for Ifx_CIF_JPE_Y_SCALE_EN_Bits.Y_SCALE_EN */
#define IFX_CIF_JPE_Y_SCALE_EN_Y_SCALE_EN_LEN (1)

/** \\brief  Mask for Ifx_CIF_JPE_Y_SCALE_EN_Bits.Y_SCALE_EN */
#define IFX_CIF_JPE_Y_SCALE_EN_Y_SCALE_EN_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_JPE_Y_SCALE_EN_Bits.Y_SCALE_EN */
#define IFX_CIF_JPE_Y_SCALE_EN_Y_SCALE_EN_OFF (0)

/** \\brief  Length for Ifx_CIF_LDS_CTRL_Bits.LDS_H_EN */
#define IFX_CIF_LDS_CTRL_LDS_H_EN_LEN (1)

/** \\brief  Mask for Ifx_CIF_LDS_CTRL_Bits.LDS_H_EN */
#define IFX_CIF_LDS_CTRL_LDS_H_EN_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_LDS_CTRL_Bits.LDS_H_EN */
#define IFX_CIF_LDS_CTRL_LDS_H_EN_OFF (1)

/** \\brief  Length for Ifx_CIF_LDS_CTRL_Bits.LDS_H_MODE */
#define IFX_CIF_LDS_CTRL_LDS_H_MODE_LEN (2)

/** \\brief  Mask for Ifx_CIF_LDS_CTRL_Bits.LDS_H_MODE */
#define IFX_CIF_LDS_CTRL_LDS_H_MODE_MSK (0x3)

/** \\brief  Offset for Ifx_CIF_LDS_CTRL_Bits.LDS_H_MODE */
#define IFX_CIF_LDS_CTRL_LDS_H_MODE_OFF (8)

/** \\brief  Length for Ifx_CIF_LDS_CTRL_Bits.LDS_V_EN */
#define IFX_CIF_LDS_CTRL_LDS_V_EN_LEN (1)

/** \\brief  Mask for Ifx_CIF_LDS_CTRL_Bits.LDS_V_EN */
#define IFX_CIF_LDS_CTRL_LDS_V_EN_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_LDS_CTRL_Bits.LDS_V_EN */
#define IFX_CIF_LDS_CTRL_LDS_V_EN_OFF (0)

/** \\brief  Length for Ifx_CIF_LDS_CTRL_Bits.LDS_V_MODE */
#define IFX_CIF_LDS_CTRL_LDS_V_MODE_LEN (2)

/** \\brief  Mask for Ifx_CIF_LDS_CTRL_Bits.LDS_V_MODE */
#define IFX_CIF_LDS_CTRL_LDS_V_MODE_MSK (0x3)

/** \\brief  Offset for Ifx_CIF_LDS_CTRL_Bits.LDS_V_MODE */
#define IFX_CIF_LDS_CTRL_LDS_V_MODE_OFF (4)

/** \\brief  Length for Ifx_CIF_LDS_FAC_Bits.LDS_H_FAC */
#define IFX_CIF_LDS_FAC_LDS_H_FAC_LEN (8)

/** \\brief  Mask for Ifx_CIF_LDS_FAC_Bits.LDS_H_FAC */
#define IFX_CIF_LDS_FAC_LDS_H_FAC_MSK (0xff)

/** \\brief  Offset for Ifx_CIF_LDS_FAC_Bits.LDS_H_FAC */
#define IFX_CIF_LDS_FAC_LDS_H_FAC_OFF (16)

/** \\brief  Length for Ifx_CIF_LDS_FAC_Bits.LDS_V_FAC */
#define IFX_CIF_LDS_FAC_LDS_V_FAC_LEN (8)

/** \\brief  Mask for Ifx_CIF_LDS_FAC_Bits.LDS_V_FAC */
#define IFX_CIF_LDS_FAC_LDS_V_FAC_MSK (0xff)

/** \\brief  Offset for Ifx_CIF_LDS_FAC_Bits.LDS_V_FAC */
#define IFX_CIF_LDS_FAC_LDS_V_FAC_OFF (0)

/** \\brief  Length for Ifx_CIF_MI_BYTE_CNT_Bits.BYTE_CNT */
#define IFX_CIF_MI_BYTE_CNT_BYTE_CNT_LEN (24)

/** \\brief  Mask for Ifx_CIF_MI_BYTE_CNT_Bits.BYTE_CNT */
#define IFX_CIF_MI_BYTE_CNT_BYTE_CNT_MSK (0xffffff)

/** \\brief  Offset for Ifx_CIF_MI_BYTE_CNT_Bits.BYTE_CNT */
#define IFX_CIF_MI_BYTE_CNT_BYTE_CNT_OFF (0)

/** \\brief  Length for Ifx_CIF_MI_CTRL_Bits.BURST_LEN_CHROM */
#define IFX_CIF_MI_CTRL_BURST_LEN_CHROM_LEN (1)

/** \\brief  Mask for Ifx_CIF_MI_CTRL_Bits.BURST_LEN_CHROM */
#define IFX_CIF_MI_CTRL_BURST_LEN_CHROM_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MI_CTRL_Bits.BURST_LEN_CHROM */
#define IFX_CIF_MI_CTRL_BURST_LEN_CHROM_OFF (18)

/** \\brief  Length for Ifx_CIF_MI_CTRL_Bits.BURST_LEN_LUM */
#define IFX_CIF_MI_CTRL_BURST_LEN_LUM_LEN (1)

/** \\brief  Mask for Ifx_CIF_MI_CTRL_Bits.BURST_LEN_LUM */
#define IFX_CIF_MI_CTRL_BURST_LEN_LUM_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MI_CTRL_Bits.BURST_LEN_LUM */
#define IFX_CIF_MI_CTRL_BURST_LEN_LUM_OFF (16)

/** \\brief  Length for Ifx_CIF_MI_CTRL_Bits.BYTE_SWAP */
#define IFX_CIF_MI_CTRL_BYTE_SWAP_LEN (1)

/** \\brief  Mask for Ifx_CIF_MI_CTRL_Bits.BYTE_SWAP */
#define IFX_CIF_MI_CTRL_BYTE_SWAP_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MI_CTRL_Bits.BYTE_SWAP */
#define IFX_CIF_MI_CTRL_BYTE_SWAP_OFF (7)

/** \\brief  Length for Ifx_CIF_MI_CTRL_Bits.INIT_BASE_EN */
#define IFX_CIF_MI_CTRL_INIT_BASE_EN_LEN (1)

/** \\brief  Mask for Ifx_CIF_MI_CTRL_Bits.INIT_BASE_EN */
#define IFX_CIF_MI_CTRL_INIT_BASE_EN_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MI_CTRL_Bits.INIT_BASE_EN */
#define IFX_CIF_MI_CTRL_INIT_BASE_EN_OFF (20)

/** \\brief  Length for Ifx_CIF_MI_CTRL_Bits.INIT_OFFSET_EN */
#define IFX_CIF_MI_CTRL_INIT_OFFSET_EN_LEN (1)

/** \\brief  Mask for Ifx_CIF_MI_CTRL_Bits.INIT_OFFSET_EN */
#define IFX_CIF_MI_CTRL_INIT_OFFSET_EN_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MI_CTRL_Bits.INIT_OFFSET_EN */
#define IFX_CIF_MI_CTRL_INIT_OFFSET_EN_OFF (21)

/** \\brief  Length for Ifx_CIF_MI_CTRL_Bits.JPEG_ENABLE */
#define IFX_CIF_MI_CTRL_JPEG_ENABLE_LEN (1)

/** \\brief  Mask for Ifx_CIF_MI_CTRL_Bits.JPEG_ENABLE */
#define IFX_CIF_MI_CTRL_JPEG_ENABLE_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MI_CTRL_Bits.JPEG_ENABLE */
#define IFX_CIF_MI_CTRL_JPEG_ENABLE_OFF (2)

/** \\brief  Length for Ifx_CIF_MI_CTRL_Bits.MP_ENABLE */
#define IFX_CIF_MI_CTRL_MP_ENABLE_LEN (1)

/** \\brief  Mask for Ifx_CIF_MI_CTRL_Bits.MP_ENABLE */
#define IFX_CIF_MI_CTRL_MP_ENABLE_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MI_CTRL_Bits.MP_ENABLE */
#define IFX_CIF_MI_CTRL_MP_ENABLE_OFF (0)

/** \\brief  Length for Ifx_CIF_MI_CTRL_Bits.MP_WRITE_FORMAT */
#define IFX_CIF_MI_CTRL_MP_WRITE_FORMAT_LEN (2)

/** \\brief  Mask for Ifx_CIF_MI_CTRL_Bits.MP_WRITE_FORMAT */
#define IFX_CIF_MI_CTRL_MP_WRITE_FORMAT_MSK (0x3)

/** \\brief  Offset for Ifx_CIF_MI_CTRL_Bits.MP_WRITE_FORMAT */
#define IFX_CIF_MI_CTRL_MP_WRITE_FORMAT_OFF (22)

/** \\brief  Length for Ifx_CIF_MI_CTRL_Bits.RAW_ENABLE */
#define IFX_CIF_MI_CTRL_RAW_ENABLE_LEN (1)

/** \\brief  Mask for Ifx_CIF_MI_CTRL_Bits.RAW_ENABLE */
#define IFX_CIF_MI_CTRL_RAW_ENABLE_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MI_CTRL_Bits.RAW_ENABLE */
#define IFX_CIF_MI_CTRL_RAW_ENABLE_OFF (3)

/** \\brief  Length for Ifx_CIF_MI_CTRL_SHD_Bits.JPEG_ENABLE_IN */
#define IFX_CIF_MI_CTRL_SHD_JPEG_ENABLE_IN_LEN (1)

/** \\brief  Mask for Ifx_CIF_MI_CTRL_SHD_Bits.JPEG_ENABLE_IN */
#define IFX_CIF_MI_CTRL_SHD_JPEG_ENABLE_IN_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MI_CTRL_SHD_Bits.JPEG_ENABLE_IN */
#define IFX_CIF_MI_CTRL_SHD_JPEG_ENABLE_IN_OFF (4)

