keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCif_bf.h
/** \\brief  Offset for Ifx_CIF_MI_IMSC_Bits.WRAP_MP_Y */
#define IFX_CIF_MI_IMSC_WRAP_MP_Y_OFF (4)

/** \\brief  Length for Ifx_CIF_MI_INIT_Bits.MI_CFG_UPD */
#define IFX_CIF_MI_INIT_MI_CFG_UPD_LEN (1)

/** \\brief  Mask for Ifx_CIF_MI_INIT_Bits.MI_CFG_UPD */
#define IFX_CIF_MI_INIT_MI_CFG_UPD_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MI_INIT_Bits.MI_CFG_UPD */
#define IFX_CIF_MI_INIT_MI_CFG_UPD_OFF (4)

/** \\brief  Length for Ifx_CIF_MI_INIT_Bits.MI_SKIP */
#define IFX_CIF_MI_INIT_MI_SKIP_LEN (1)

/** \\brief  Mask for Ifx_CIF_MI_INIT_Bits.MI_SKIP */
#define IFX_CIF_MI_INIT_MI_SKIP_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MI_INIT_Bits.MI_SKIP */
#define IFX_CIF_MI_INIT_MI_SKIP_OFF (2)

/** \\brief  Length for Ifx_CIF_MI_ISR_Bits.Bus_ERROR */
#define IFX_CIF_MI_ISR_BUS_ERROR_LEN (1)

/** \\brief  Mask for Ifx_CIF_MI_ISR_Bits.Bus_ERROR */
#define IFX_CIF_MI_ISR_BUS_ERROR_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MI_ISR_Bits.Bus_ERROR */
#define IFX_CIF_MI_ISR_BUS_ERROR_OFF (10)

/** \\brief  Length for Ifx_CIF_MI_ISR_Bits.FILL_MP_Y */
#define IFX_CIF_MI_ISR_FILL_MP_Y_LEN (1)

/** \\brief  Mask for Ifx_CIF_MI_ISR_Bits.FILL_MP_Y */
#define IFX_CIF_MI_ISR_FILL_MP_Y_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MI_ISR_Bits.FILL_MP_Y */
#define IFX_CIF_MI_ISR_FILL_MP_Y_OFF (3)

/** \\brief  Length for Ifx_CIF_MI_ISR_Bits.MBLK_LINE */
#define IFX_CIF_MI_ISR_MBLK_LINE_LEN (1)

/** \\brief  Mask for Ifx_CIF_MI_ISR_Bits.MBLK_LINE */
#define IFX_CIF_MI_ISR_MBLK_LINE_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MI_ISR_Bits.MBLK_LINE */
#define IFX_CIF_MI_ISR_MBLK_LINE_OFF (2)

/** \\brief  Length for Ifx_CIF_MI_ISR_Bits.MP_FRAME_END */
#define IFX_CIF_MI_ISR_MP_FRAME_END_LEN (1)

/** \\brief  Mask for Ifx_CIF_MI_ISR_Bits.MP_FRAME_END */
#define IFX_CIF_MI_ISR_MP_FRAME_END_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MI_ISR_Bits.MP_FRAME_END */
#define IFX_CIF_MI_ISR_MP_FRAME_END_OFF (0)

/** \\brief  Length for Ifx_CIF_MI_ISR_Bits.WRAP_MP_CB */
#define IFX_CIF_MI_ISR_WRAP_MP_CB_LEN (1)

/** \\brief  Mask for Ifx_CIF_MI_ISR_Bits.WRAP_MP_CB */
#define IFX_CIF_MI_ISR_WRAP_MP_CB_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MI_ISR_Bits.WRAP_MP_CB */
#define IFX_CIF_MI_ISR_WRAP_MP_CB_OFF (5)

/** \\brief  Length for Ifx_CIF_MI_ISR_Bits.WRAP_MP_CR */
#define IFX_CIF_MI_ISR_WRAP_MP_CR_LEN (1)

/** \\brief  Mask for Ifx_CIF_MI_ISR_Bits.WRAP_MP_CR */
#define IFX_CIF_MI_ISR_WRAP_MP_CR_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MI_ISR_Bits.WRAP_MP_CR */
#define IFX_CIF_MI_ISR_WRAP_MP_CR_OFF (6)

/** \\brief  Length for Ifx_CIF_MI_ISR_Bits.WRAP_MP_Y */
#define IFX_CIF_MI_ISR_WRAP_MP_Y_LEN (1)

/** \\brief  Mask for Ifx_CIF_MI_ISR_Bits.WRAP_MP_Y */
#define IFX_CIF_MI_ISR_WRAP_MP_Y_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MI_ISR_Bits.WRAP_MP_Y */
#define IFX_CIF_MI_ISR_WRAP_MP_Y_OFF (4)

/** \\brief  Length for Ifx_CIF_MI_MIS_Bits.BUS_ERROR */
#define IFX_CIF_MI_MIS_BUS_ERROR_LEN (1)

/** \\brief  Mask for Ifx_CIF_MI_MIS_Bits.BUS_ERROR */
#define IFX_CIF_MI_MIS_BUS_ERROR_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MI_MIS_Bits.BUS_ERROR */
#define IFX_CIF_MI_MIS_BUS_ERROR_OFF (10)

/** \\brief  Length for Ifx_CIF_MI_MIS_Bits.FILL_MP_Y */
#define IFX_CIF_MI_MIS_FILL_MP_Y_LEN (1)

/** \\brief  Mask for Ifx_CIF_MI_MIS_Bits.FILL_MP_Y */
#define IFX_CIF_MI_MIS_FILL_MP_Y_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MI_MIS_Bits.FILL_MP_Y */
#define IFX_CIF_MI_MIS_FILL_MP_Y_OFF (3)

/** \\brief  Length for Ifx_CIF_MI_MIS_Bits.MBLK_LINE */
#define IFX_CIF_MI_MIS_MBLK_LINE_LEN (1)

/** \\brief  Mask for Ifx_CIF_MI_MIS_Bits.MBLK_LINE */
#define IFX_CIF_MI_MIS_MBLK_LINE_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MI_MIS_Bits.MBLK_LINE */
#define IFX_CIF_MI_MIS_MBLK_LINE_OFF (2)

/** \\brief  Length for Ifx_CIF_MI_MIS_Bits.MP_FRAME_END */
#define IFX_CIF_MI_MIS_MP_FRAME_END_LEN (1)

/** \\brief  Mask for Ifx_CIF_MI_MIS_Bits.MP_FRAME_END */
#define IFX_CIF_MI_MIS_MP_FRAME_END_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MI_MIS_Bits.MP_FRAME_END */
#define IFX_CIF_MI_MIS_MP_FRAME_END_OFF (0)

/** \\brief  Length for Ifx_CIF_MI_MIS_Bits.WRAP_MP_CB */
#define IFX_CIF_MI_MIS_WRAP_MP_CB_LEN (1)

/** \\brief  Mask for Ifx_CIF_MI_MIS_Bits.WRAP_MP_CB */
#define IFX_CIF_MI_MIS_WRAP_MP_CB_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MI_MIS_Bits.WRAP_MP_CB */
#define IFX_CIF_MI_MIS_WRAP_MP_CB_OFF (5)

/** \\brief  Length for Ifx_CIF_MI_MIS_Bits.WRAP_MP_CR */
#define IFX_CIF_MI_MIS_WRAP_MP_CR_LEN (1)

/** \\brief  Mask for Ifx_CIF_MI_MIS_Bits.WRAP_MP_CR */
#define IFX_CIF_MI_MIS_WRAP_MP_CR_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MI_MIS_Bits.WRAP_MP_CR */
#define IFX_CIF_MI_MIS_WRAP_MP_CR_OFF (6)

/** \\brief  Length for Ifx_CIF_MI_MIS_Bits.WRAP_MP_Y */
#define IFX_CIF_MI_MIS_WRAP_MP_Y_LEN (1)

/** \\brief  Mask for Ifx_CIF_MI_MIS_Bits.WRAP_MP_Y */
#define IFX_CIF_MI_MIS_WRAP_MP_Y_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MI_MIS_Bits.WRAP_MP_Y */
#define IFX_CIF_MI_MIS_WRAP_MP_Y_OFF (4)

/** \\brief  Length for Ifx_CIF_MI_MP_CB_BASE_AD_INIT_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_CB_BASE_AD_INIT_FIXED_TO_00_LEN (2)

/** \\brief  Mask for Ifx_CIF_MI_MP_CB_BASE_AD_INIT_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_CB_BASE_AD_INIT_FIXED_TO_00_MSK (0x3)

/** \\brief  Offset for Ifx_CIF_MI_MP_CB_BASE_AD_INIT_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_CB_BASE_AD_INIT_FIXED_TO_00_OFF (0)

/** \\brief  Length for Ifx_CIF_MI_MP_CB_BASE_AD_INIT_Bits.MP_CB_BASEAD_INIT */
#define IFX_CIF_MI_MP_CB_BASE_AD_INIT_MP_CB_BASEAD_INIT_LEN (30)

/** \\brief  Mask for Ifx_CIF_MI_MP_CB_BASE_AD_INIT_Bits.MP_CB_BASEAD_INIT */
#define IFX_CIF_MI_MP_CB_BASE_AD_INIT_MP_CB_BASEAD_INIT_MSK (0x3fffffff)

/** \\brief  Offset for Ifx_CIF_MI_MP_CB_BASE_AD_INIT_Bits.MP_CB_BASEAD_INIT */
#define IFX_CIF_MI_MP_CB_BASE_AD_INIT_MP_CB_BASEAD_INIT_OFF (2)

/** \\brief  Length for Ifx_CIF_MI_MP_CB_BASE_AD_SHD_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_CB_BASE_AD_SHD_FIXED_TO_00_LEN (2)

/** \\brief  Mask for Ifx_CIF_MI_MP_CB_BASE_AD_SHD_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_CB_BASE_AD_SHD_FIXED_TO_00_MSK (0x3)

/** \\brief  Offset for Ifx_CIF_MI_MP_CB_BASE_AD_SHD_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_CB_BASE_AD_SHD_FIXED_TO_00_OFF (0)

/** \\brief  Length for Ifx_CIF_MI_MP_CB_BASE_AD_SHD_Bits.MP_CB_BASE_AD */
#define IFX_CIF_MI_MP_CB_BASE_AD_SHD_MP_CB_BASE_AD_LEN (30)

