keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCif_bf.h
/** \\brief  Mask for Ifx_CIF_MI_MP_Y_IRQ_OFFS_SHD_Bits.MP_Y_IRQ_OFFS */
#define IFX_CIF_MI_MP_Y_IRQ_OFFS_SHD_MP_Y_IRQ_OFFS_MSK (0x3fffff)

/** \\brief  Offset for Ifx_CIF_MI_MP_Y_IRQ_OFFS_SHD_Bits.MP_Y_IRQ_OFFS */
#define IFX_CIF_MI_MP_Y_IRQ_OFFS_SHD_MP_Y_IRQ_OFFS_OFF (2)

/** \\brief  Length for Ifx_CIF_MI_MP_Y_OFFS_CNT_INIT_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_Y_OFFS_CNT_INIT_FIXED_TO_00_LEN (2)

/** \\brief  Mask for Ifx_CIF_MI_MP_Y_OFFS_CNT_INIT_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_Y_OFFS_CNT_INIT_FIXED_TO_00_MSK (0x3)

/** \\brief  Offset for Ifx_CIF_MI_MP_Y_OFFS_CNT_INIT_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_Y_OFFS_CNT_INIT_FIXED_TO_00_OFF (0)

/** \\brief  Length for Ifx_CIF_MI_MP_Y_OFFS_CNT_INIT_Bits.MP_Y_OFFS_CNT_INIT */
#define IFX_CIF_MI_MP_Y_OFFS_CNT_INIT_MP_Y_OFFS_CNT_INIT_LEN (22)

/** \\brief  Mask for Ifx_CIF_MI_MP_Y_OFFS_CNT_INIT_Bits.MP_Y_OFFS_CNT_INIT */
#define IFX_CIF_MI_MP_Y_OFFS_CNT_INIT_MP_Y_OFFS_CNT_INIT_MSK (0x3fffff)

/** \\brief  Offset for Ifx_CIF_MI_MP_Y_OFFS_CNT_INIT_Bits.MP_Y_OFFS_CNT_INIT */
#define IFX_CIF_MI_MP_Y_OFFS_CNT_INIT_MP_Y_OFFS_CNT_INIT_OFF (2)

/** \\brief  Length for Ifx_CIF_MI_MP_Y_OFFS_CNT_SHD_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_Y_OFFS_CNT_SHD_FIXED_TO_00_LEN (2)

/** \\brief  Mask for Ifx_CIF_MI_MP_Y_OFFS_CNT_SHD_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_Y_OFFS_CNT_SHD_FIXED_TO_00_MSK (0x3)

/** \\brief  Offset for Ifx_CIF_MI_MP_Y_OFFS_CNT_SHD_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_Y_OFFS_CNT_SHD_FIXED_TO_00_OFF (0)

/** \\brief  Length for Ifx_CIF_MI_MP_Y_OFFS_CNT_SHD_Bits.MP_Y_OFFS_CNT */
#define IFX_CIF_MI_MP_Y_OFFS_CNT_SHD_MP_Y_OFFS_CNT_LEN (22)

/** \\brief  Mask for Ifx_CIF_MI_MP_Y_OFFS_CNT_SHD_Bits.MP_Y_OFFS_CNT */
#define IFX_CIF_MI_MP_Y_OFFS_CNT_SHD_MP_Y_OFFS_CNT_MSK (0x3fffff)

/** \\brief  Offset for Ifx_CIF_MI_MP_Y_OFFS_CNT_SHD_Bits.MP_Y_OFFS_CNT */
#define IFX_CIF_MI_MP_Y_OFFS_CNT_SHD_MP_Y_OFFS_CNT_OFF (2)

/** \\brief  Length for Ifx_CIF_MI_MP_Y_OFFS_CNT_START_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_Y_OFFS_CNT_START_FIXED_TO_00_LEN (2)

/** \\brief  Mask for Ifx_CIF_MI_MP_Y_OFFS_CNT_START_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_Y_OFFS_CNT_START_FIXED_TO_00_MSK (0x3)

/** \\brief  Offset for Ifx_CIF_MI_MP_Y_OFFS_CNT_START_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_Y_OFFS_CNT_START_FIXED_TO_00_OFF (0)

/** \\brief  Length for Ifx_CIF_MI_MP_Y_OFFS_CNT_START_Bits.MP_Y_OFFS_CNT_START */
#define IFX_CIF_MI_MP_Y_OFFS_CNT_START_MP_Y_OFFS_CNT_START_LEN (22)

/** \\brief  Mask for Ifx_CIF_MI_MP_Y_OFFS_CNT_START_Bits.MP_Y_OFFS_CNT_START */
#define IFX_CIF_MI_MP_Y_OFFS_CNT_START_MP_Y_OFFS_CNT_START_MSK (0x3fffff)

/** \\brief  Offset for Ifx_CIF_MI_MP_Y_OFFS_CNT_START_Bits.MP_Y_OFFS_CNT_START */
#define IFX_CIF_MI_MP_Y_OFFS_CNT_START_MP_Y_OFFS_CNT_START_OFF (2)

/** \\brief  Length for Ifx_CIF_MI_MP_Y_SIZE_INIT_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_Y_SIZE_INIT_FIXED_TO_00_LEN (2)

/** \\brief  Mask for Ifx_CIF_MI_MP_Y_SIZE_INIT_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_Y_SIZE_INIT_FIXED_TO_00_MSK (0x3)

/** \\brief  Offset for Ifx_CIF_MI_MP_Y_SIZE_INIT_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_Y_SIZE_INIT_FIXED_TO_00_OFF (0)

/** \\brief  Length for Ifx_CIF_MI_MP_Y_SIZE_INIT_Bits.MP_Y_SIZE_INIT */
#define IFX_CIF_MI_MP_Y_SIZE_INIT_MP_Y_SIZE_INIT_LEN (22)

/** \\brief  Mask for Ifx_CIF_MI_MP_Y_SIZE_INIT_Bits.MP_Y_SIZE_INIT */
#define IFX_CIF_MI_MP_Y_SIZE_INIT_MP_Y_SIZE_INIT_MSK (0x3fffff)

/** \\brief  Offset for Ifx_CIF_MI_MP_Y_SIZE_INIT_Bits.MP_Y_SIZE_INIT */
#define IFX_CIF_MI_MP_Y_SIZE_INIT_MP_Y_SIZE_INIT_OFF (2)

/** \\brief  Length for Ifx_CIF_MI_MP_Y_SIZE_SHD_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_Y_SIZE_SHD_FIXED_TO_00_LEN (2)

/** \\brief  Mask for Ifx_CIF_MI_MP_Y_SIZE_SHD_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_Y_SIZE_SHD_FIXED_TO_00_MSK (0x3)

/** \\brief  Offset for Ifx_CIF_MI_MP_Y_SIZE_SHD_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_Y_SIZE_SHD_FIXED_TO_00_OFF (0)

/** \\brief  Length for Ifx_CIF_MI_MP_Y_SIZE_SHD_Bits.MP_Y_SIZE */
#define IFX_CIF_MI_MP_Y_SIZE_SHD_MP_Y_SIZE_LEN (22)

/** \\brief  Mask for Ifx_CIF_MI_MP_Y_SIZE_SHD_Bits.MP_Y_SIZE */
#define IFX_CIF_MI_MP_Y_SIZE_SHD_MP_Y_SIZE_MSK (0x3fffff)

/** \\brief  Offset for Ifx_CIF_MI_MP_Y_SIZE_SHD_Bits.MP_Y_SIZE */
#define IFX_CIF_MI_MP_Y_SIZE_SHD_MP_Y_SIZE_OFF (2)

/** \\brief  Length for Ifx_CIF_MI_RIS_Bits.BUS_ERROR */
#define IFX_CIF_MI_RIS_BUS_ERROR_LEN (1)

/** \\brief  Mask for Ifx_CIF_MI_RIS_Bits.BUS_ERROR */
#define IFX_CIF_MI_RIS_BUS_ERROR_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MI_RIS_Bits.BUS_ERROR */
#define IFX_CIF_MI_RIS_BUS_ERROR_OFF (10)

/** \\brief  Length for Ifx_CIF_MI_RIS_Bits.FILL_MP_Y */
#define IFX_CIF_MI_RIS_FILL_MP_Y_LEN (1)

/** \\brief  Mask for Ifx_CIF_MI_RIS_Bits.FILL_MP_Y */
#define IFX_CIF_MI_RIS_FILL_MP_Y_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MI_RIS_Bits.FILL_MP_Y */
#define IFX_CIF_MI_RIS_FILL_MP_Y_OFF (3)

/** \\brief  Length for Ifx_CIF_MI_RIS_Bits.MBLK_LINE */
#define IFX_CIF_MI_RIS_MBLK_LINE_LEN (1)

/** \\brief  Mask for Ifx_CIF_MI_RIS_Bits.MBLK_LINE */
#define IFX_CIF_MI_RIS_MBLK_LINE_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MI_RIS_Bits.MBLK_LINE */
#define IFX_CIF_MI_RIS_MBLK_LINE_OFF (2)

/** \\brief  Length for Ifx_CIF_MI_RIS_Bits.MP_FRAME_END */
#define IFX_CIF_MI_RIS_MP_FRAME_END_LEN (1)

/** \\brief  Mask for Ifx_CIF_MI_RIS_Bits.MP_FRAME_END */
#define IFX_CIF_MI_RIS_MP_FRAME_END_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MI_RIS_Bits.MP_FRAME_END */
#define IFX_CIF_MI_RIS_MP_FRAME_END_OFF (0)

/** \\brief  Length for Ifx_CIF_MI_RIS_Bits.WRAP_MP_CB */
#define IFX_CIF_MI_RIS_WRAP_MP_CB_LEN (1)

/** \\brief  Mask for Ifx_CIF_MI_RIS_Bits.WRAP_MP_CB */
#define IFX_CIF_MI_RIS_WRAP_MP_CB_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MI_RIS_Bits.WRAP_MP_CB */
#define IFX_CIF_MI_RIS_WRAP_MP_CB_OFF (5)

/** \\brief  Length for Ifx_CIF_MI_RIS_Bits.WRAP_MP_CR */
#define IFX_CIF_MI_RIS_WRAP_MP_CR_LEN (1)

/** \\brief  Mask for Ifx_CIF_MI_RIS_Bits.WRAP_MP_CR */
#define IFX_CIF_MI_RIS_WRAP_MP_CR_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MI_RIS_Bits.WRAP_MP_CR */
#define IFX_CIF_MI_RIS_WRAP_MP_CR_OFF (6)

/** \\brief  Length for Ifx_CIF_MI_RIS_Bits.WRAP_MP_Y */
#define IFX_CIF_MI_RIS_WRAP_MP_Y_LEN (1)

/** \\brief  Mask for Ifx_CIF_MI_RIS_Bits.WRAP_MP_Y */
#define IFX_CIF_MI_RIS_WRAP_MP_Y_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MI_RIS_Bits.WRAP_MP_Y */
#define IFX_CIF_MI_RIS_WRAP_MP_Y_OFF (4)

/** \\brief  Length for Ifx_CIF_MI_STATUS_Bits.BUS_WRITE_ERROR */
#define IFX_CIF_MI_STATUS_BUS_WRITE_ERROR_LEN (1)

/** \\brief  Mask for Ifx_CIF_MI_STATUS_Bits.BUS_WRITE_ERROR */
#define IFX_CIF_MI_STATUS_BUS_WRITE_ERROR_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MI_STATUS_Bits.BUS_WRITE_ERROR */
#define IFX_CIF_MI_STATUS_BUS_WRITE_ERROR_OFF (8)

/** \\brief  Length for Ifx_CIF_MI_STATUS_CLR_Bits.BUS_WRITE_ERROR */
#define IFX_CIF_MI_STATUS_CLR_BUS_WRITE_ERROR_LEN (1)

/** \\brief  Mask for Ifx_CIF_MI_STATUS_CLR_Bits.BUS_WRITE_ERROR */
#define IFX_CIF_MI_STATUS_CLR_BUS_WRITE_ERROR_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MI_STATUS_CLR_Bits.BUS_WRITE_ERROR */
#define IFX_CIF_MI_STATUS_CLR_BUS_WRITE_ERROR_OFF (8)

/** \\brief  Length for Ifx_CIF_MI_STATUS_CLR_Bits.EP_1_FIFO_FULL */
#define IFX_CIF_MI_STATUS_CLR_EP_1_FIFO_FULL_LEN (1)

/** \\brief  Mask for Ifx_CIF_MI_STATUS_CLR_Bits.EP_1_FIFO_FULL */
#define IFX_CIF_MI_STATUS_CLR_EP_1_FIFO_FULL_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MI_STATUS_CLR_Bits.EP_1_FIFO_FULL */
#define IFX_CIF_MI_STATUS_CLR_EP_1_FIFO_FULL_OFF (24)

/** \\brief  Length for Ifx_CIF_MI_STATUS_CLR_Bits.EP_2_FIFO_FULL */
#define IFX_CIF_MI_STATUS_CLR_EP_2_FIFO_FULL_LEN (1)

/** \\brief  Mask for Ifx_CIF_MI_STATUS_CLR_Bits.EP_2_FIFO_FULL */
#define IFX_CIF_MI_STATUS_CLR_EP_2_FIFO_FULL_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MI_STATUS_CLR_Bits.EP_2_FIFO_FULL */
#define IFX_CIF_MI_STATUS_CLR_EP_2_FIFO_FULL_OFF (25)

/** \\brief  Length for Ifx_CIF_MI_STATUS_CLR_Bits.EP_3_FIFO_FULL */
#define IFX_CIF_MI_STATUS_CLR_EP_3_FIFO_FULL_LEN (1)

