keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCif_bf.h
/** \\brief  Mask for Ifx_CIF_MI_STATUS_CLR_Bits.EP_3_FIFO_FULL */
#define IFX_CIF_MI_STATUS_CLR_EP_3_FIFO_FULL_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MI_STATUS_CLR_Bits.EP_3_FIFO_FULL */
#define IFX_CIF_MI_STATUS_CLR_EP_3_FIFO_FULL_OFF (26)

/** \\brief  Length for Ifx_CIF_MI_STATUS_CLR_Bits.EP_4_FIFO_FULL */
#define IFX_CIF_MI_STATUS_CLR_EP_4_FIFO_FULL_LEN (1)

/** \\brief  Mask for Ifx_CIF_MI_STATUS_CLR_Bits.EP_4_FIFO_FULL */
#define IFX_CIF_MI_STATUS_CLR_EP_4_FIFO_FULL_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MI_STATUS_CLR_Bits.EP_4_FIFO_FULL */
#define IFX_CIF_MI_STATUS_CLR_EP_4_FIFO_FULL_OFF (27)

/** \\brief  Length for Ifx_CIF_MI_STATUS_CLR_Bits.EP_5_FIFO_FULL */
#define IFX_CIF_MI_STATUS_CLR_EP_5_FIFO_FULL_LEN (1)

/** \\brief  Mask for Ifx_CIF_MI_STATUS_CLR_Bits.EP_5_FIFO_FULL */
#define IFX_CIF_MI_STATUS_CLR_EP_5_FIFO_FULL_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MI_STATUS_CLR_Bits.EP_5_FIFO_FULL */
#define IFX_CIF_MI_STATUS_CLR_EP_5_FIFO_FULL_OFF (28)

/** \\brief  Length for Ifx_CIF_MI_STATUS_CLR_Bits.MP_CB_FIFO_FULL */
#define IFX_CIF_MI_STATUS_CLR_MP_CB_FIFO_FULL_LEN (1)

/** \\brief  Mask for Ifx_CIF_MI_STATUS_CLR_Bits.MP_CB_FIFO_FULL */
#define IFX_CIF_MI_STATUS_CLR_MP_CB_FIFO_FULL_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MI_STATUS_CLR_Bits.MP_CB_FIFO_FULL */
#define IFX_CIF_MI_STATUS_CLR_MP_CB_FIFO_FULL_OFF (1)

/** \\brief  Length for Ifx_CIF_MI_STATUS_CLR_Bits.MP_CR_FIFO_FULL */
#define IFX_CIF_MI_STATUS_CLR_MP_CR_FIFO_FULL_LEN (1)

/** \\brief  Mask for Ifx_CIF_MI_STATUS_CLR_Bits.MP_CR_FIFO_FULL */
#define IFX_CIF_MI_STATUS_CLR_MP_CR_FIFO_FULL_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MI_STATUS_CLR_Bits.MP_CR_FIFO_FULL */
#define IFX_CIF_MI_STATUS_CLR_MP_CR_FIFO_FULL_OFF (2)

/** \\brief  Length for Ifx_CIF_MI_STATUS_CLR_Bits.MP_Y_FIFO_FULL */
#define IFX_CIF_MI_STATUS_CLR_MP_Y_FIFO_FULL_LEN (1)

/** \\brief  Mask for Ifx_CIF_MI_STATUS_CLR_Bits.MP_Y_FIFO_FULL */
#define IFX_CIF_MI_STATUS_CLR_MP_Y_FIFO_FULL_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MI_STATUS_CLR_Bits.MP_Y_FIFO_FULL */
#define IFX_CIF_MI_STATUS_CLR_MP_Y_FIFO_FULL_OFF (0)

/** \\brief  Length for Ifx_CIF_MI_STATUS_Bits.MP_CB_FIFO_FULL */
#define IFX_CIF_MI_STATUS_MP_CB_FIFO_FULL_LEN (1)

/** \\brief  Mask for Ifx_CIF_MI_STATUS_Bits.MP_CB_FIFO_FULL */
#define IFX_CIF_MI_STATUS_MP_CB_FIFO_FULL_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MI_STATUS_Bits.MP_CB_FIFO_FULL */
#define IFX_CIF_MI_STATUS_MP_CB_FIFO_FULL_OFF (1)

/** \\brief  Length for Ifx_CIF_MI_STATUS_Bits.MP_CR_FIFO_FULL */
#define IFX_CIF_MI_STATUS_MP_CR_FIFO_FULL_LEN (1)

/** \\brief  Mask for Ifx_CIF_MI_STATUS_Bits.MP_CR_FIFO_FULL */
#define IFX_CIF_MI_STATUS_MP_CR_FIFO_FULL_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MI_STATUS_Bits.MP_CR_FIFO_FULL */
#define IFX_CIF_MI_STATUS_MP_CR_FIFO_FULL_OFF (2)

/** \\brief  Length for Ifx_CIF_MI_STATUS_Bits.MP_Y_FIFO_FULL */
#define IFX_CIF_MI_STATUS_MP_Y_FIFO_FULL_LEN (1)

/** \\brief  Mask for Ifx_CIF_MI_STATUS_Bits.MP_Y_FIFO_FULL */
#define IFX_CIF_MI_STATUS_MP_Y_FIFO_FULL_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MI_STATUS_Bits.MP_Y_FIFO_FULL */
#define IFX_CIF_MI_STATUS_MP_Y_FIFO_FULL_OFF (0)

/** \\brief  Length for Ifx_CIF_MIEP_CH_BASE_AD_INIT_Bits.EP_BASE_AD_INIT */
#define IFX_CIF_MIEP_CH_BASE_AD_INIT_EP_BASE_AD_INIT_LEN (30)

/** \\brief  Mask for Ifx_CIF_MIEP_CH_BASE_AD_INIT_Bits.EP_BASE_AD_INIT */
#define IFX_CIF_MIEP_CH_BASE_AD_INIT_EP_BASE_AD_INIT_MSK (0x3fffffff)

/** \\brief  Offset for Ifx_CIF_MIEP_CH_BASE_AD_INIT_Bits.EP_BASE_AD_INIT */
#define IFX_CIF_MIEP_CH_BASE_AD_INIT_EP_BASE_AD_INIT_OFF (2)

/** \\brief  Length for Ifx_CIF_MIEP_CH_BASE_AD_INIT_Bits.FIXED_TO_00 */
#define IFX_CIF_MIEP_CH_BASE_AD_INIT_FIXED_TO_00_LEN (2)

/** \\brief  Mask for Ifx_CIF_MIEP_CH_BASE_AD_INIT_Bits.FIXED_TO_00 */
#define IFX_CIF_MIEP_CH_BASE_AD_INIT_FIXED_TO_00_MSK (0x3)

/** \\brief  Offset for Ifx_CIF_MIEP_CH_BASE_AD_INIT_Bits.FIXED_TO_00 */
#define IFX_CIF_MIEP_CH_BASE_AD_INIT_FIXED_TO_00_OFF (0)

/** \\brief  Length for Ifx_CIF_MIEP_CH_BASE_AD_SHD_Bits.EP_BASE_AD */
#define IFX_CIF_MIEP_CH_BASE_AD_SHD_EP_BASE_AD_LEN (30)

/** \\brief  Mask for Ifx_CIF_MIEP_CH_BASE_AD_SHD_Bits.EP_BASE_AD */
#define IFX_CIF_MIEP_CH_BASE_AD_SHD_EP_BASE_AD_MSK (0x3fffffff)

/** \\brief  Offset for Ifx_CIF_MIEP_CH_BASE_AD_SHD_Bits.EP_BASE_AD */
#define IFX_CIF_MIEP_CH_BASE_AD_SHD_EP_BASE_AD_OFF (2)

/** \\brief  Length for Ifx_CIF_MIEP_CH_BASE_AD_SHD_Bits.FIXED_TO_00 */
#define IFX_CIF_MIEP_CH_BASE_AD_SHD_FIXED_TO_00_LEN (2)

/** \\brief  Mask for Ifx_CIF_MIEP_CH_BASE_AD_SHD_Bits.FIXED_TO_00 */
#define IFX_CIF_MIEP_CH_BASE_AD_SHD_FIXED_TO_00_MSK (0x3)

/** \\brief  Offset for Ifx_CIF_MIEP_CH_BASE_AD_SHD_Bits.FIXED_TO_00 */
#define IFX_CIF_MIEP_CH_BASE_AD_SHD_FIXED_TO_00_OFF (0)

/** \\brief  Length for Ifx_CIF_MIEP_CH_CTRL_Bits.BYTE_SWAP */
#define IFX_CIF_MIEP_CH_CTRL_BYTE_SWAP_LEN (1)

/** \\brief  Mask for Ifx_CIF_MIEP_CH_CTRL_Bits.BYTE_SWAP */
#define IFX_CIF_MIEP_CH_CTRL_BYTE_SWAP_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MIEP_CH_CTRL_Bits.BYTE_SWAP */
#define IFX_CIF_MIEP_CH_CTRL_BYTE_SWAP_OFF (7)

/** \\brief  Length for Ifx_CIF_MIEP_CH_CTRL_Bits.EP_ENABLE */
#define IFX_CIF_MIEP_CH_CTRL_EP_ENABLE_LEN (1)

/** \\brief  Mask for Ifx_CIF_MIEP_CH_CTRL_Bits.EP_ENABLE */
#define IFX_CIF_MIEP_CH_CTRL_EP_ENABLE_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MIEP_CH_CTRL_Bits.EP_ENABLE */
#define IFX_CIF_MIEP_CH_CTRL_EP_ENABLE_OFF (0)

/** \\brief  Length for Ifx_CIF_MIEP_CH_CTRL_Bits.EP_WRITE_FORMAT */
#define IFX_CIF_MIEP_CH_CTRL_EP_WRITE_FORMAT_LEN (2)

/** \\brief  Mask for Ifx_CIF_MIEP_CH_CTRL_Bits.EP_WRITE_FORMAT */
#define IFX_CIF_MIEP_CH_CTRL_EP_WRITE_FORMAT_MSK (0x3)

/** \\brief  Offset for Ifx_CIF_MIEP_CH_CTRL_Bits.EP_WRITE_FORMAT */
#define IFX_CIF_MIEP_CH_CTRL_EP_WRITE_FORMAT_OFF (22)

/** \\brief  Length for Ifx_CIF_MIEP_CH_CTRL_Bits.INIT_BASE_EN */
#define IFX_CIF_MIEP_CH_CTRL_INIT_BASE_EN_LEN (1)

/** \\brief  Mask for Ifx_CIF_MIEP_CH_CTRL_Bits.INIT_BASE_EN */
#define IFX_CIF_MIEP_CH_CTRL_INIT_BASE_EN_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MIEP_CH_CTRL_Bits.INIT_BASE_EN */
#define IFX_CIF_MIEP_CH_CTRL_INIT_BASE_EN_OFF (20)

/** \\brief  Length for Ifx_CIF_MIEP_CH_CTRL_Bits.INIT_OFFSET_EN */
#define IFX_CIF_MIEP_CH_CTRL_INIT_OFFSET_EN_LEN (1)

