keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCif_bf.h
/** \\brief  Mask for Ifx_CIF_MIEP_CH_CTRL_Bits.INIT_OFFSET_EN */
#define IFX_CIF_MIEP_CH_CTRL_INIT_OFFSET_EN_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MIEP_CH_CTRL_Bits.INIT_OFFSET_EN */
#define IFX_CIF_MIEP_CH_CTRL_INIT_OFFSET_EN_OFF (21)

/** \\brief  Length for Ifx_CIF_MIEP_CH_CTRL_SHD_Bits.EP_ENABLE_IN */
#define IFX_CIF_MIEP_CH_CTRL_SHD_EP_ENABLE_IN_LEN (1)

/** \\brief  Mask for Ifx_CIF_MIEP_CH_CTRL_SHD_Bits.EP_ENABLE_IN */
#define IFX_CIF_MIEP_CH_CTRL_SHD_EP_ENABLE_IN_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MIEP_CH_CTRL_SHD_Bits.EP_ENABLE_IN */
#define IFX_CIF_MIEP_CH_CTRL_SHD_EP_ENABLE_IN_OFF (0)

/** \\brief  Length for Ifx_CIF_MIEP_CH_CTRL_SHD_Bits.EP_ENABLE_OUT */
#define IFX_CIF_MIEP_CH_CTRL_SHD_EP_ENABLE_OUT_LEN (1)

/** \\brief  Mask for Ifx_CIF_MIEP_CH_CTRL_SHD_Bits.EP_ENABLE_OUT */
#define IFX_CIF_MIEP_CH_CTRL_SHD_EP_ENABLE_OUT_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MIEP_CH_CTRL_SHD_Bits.EP_ENABLE_OUT */
#define IFX_CIF_MIEP_CH_CTRL_SHD_EP_ENABLE_OUT_OFF (16)

/** \\brief  Length for Ifx_CIF_MIEP_CH_INIT_Bits.MI_EP_CFG_UPD */
#define IFX_CIF_MIEP_CH_INIT_MI_EP_CFG_UPD_LEN (1)

/** \\brief  Mask for Ifx_CIF_MIEP_CH_INIT_Bits.MI_EP_CFG_UPD */
#define IFX_CIF_MIEP_CH_INIT_MI_EP_CFG_UPD_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MIEP_CH_INIT_Bits.MI_EP_CFG_UPD */
#define IFX_CIF_MIEP_CH_INIT_MI_EP_CFG_UPD_OFF (4)

/** \\brief  Length for Ifx_CIF_MIEP_CH_INIT_Bits.MI_EP_SKIP */
#define IFX_CIF_MIEP_CH_INIT_MI_EP_SKIP_LEN (1)

/** \\brief  Mask for Ifx_CIF_MIEP_CH_INIT_Bits.MI_EP_SKIP */
#define IFX_CIF_MIEP_CH_INIT_MI_EP_SKIP_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MIEP_CH_INIT_Bits.MI_EP_SKIP */
#define IFX_CIF_MIEP_CH_INIT_MI_EP_SKIP_OFF (2)

/** \\brief  Length for Ifx_CIF_MIEP_CH_IRQ_OFFS_INIT_Bits.EP_IRQ_OFFS_INIT */
#define IFX_CIF_MIEP_CH_IRQ_OFFS_INIT_EP_IRQ_OFFS_INIT_LEN (22)

/** \\brief  Mask for Ifx_CIF_MIEP_CH_IRQ_OFFS_INIT_Bits.EP_IRQ_OFFS_INIT */
#define IFX_CIF_MIEP_CH_IRQ_OFFS_INIT_EP_IRQ_OFFS_INIT_MSK (0x3fffff)

/** \\brief  Offset for Ifx_CIF_MIEP_CH_IRQ_OFFS_INIT_Bits.EP_IRQ_OFFS_INIT */
#define IFX_CIF_MIEP_CH_IRQ_OFFS_INIT_EP_IRQ_OFFS_INIT_OFF (2)

/** \\brief  Length for Ifx_CIF_MIEP_CH_IRQ_OFFS_INIT_Bits.FIXED_TO_00 */
#define IFX_CIF_MIEP_CH_IRQ_OFFS_INIT_FIXED_TO_00_LEN (2)

/** \\brief  Mask for Ifx_CIF_MIEP_CH_IRQ_OFFS_INIT_Bits.FIXED_TO_00 */
#define IFX_CIF_MIEP_CH_IRQ_OFFS_INIT_FIXED_TO_00_MSK (0x3)

/** \\brief  Offset for Ifx_CIF_MIEP_CH_IRQ_OFFS_INIT_Bits.FIXED_TO_00 */
#define IFX_CIF_MIEP_CH_IRQ_OFFS_INIT_FIXED_TO_00_OFF (0)

/** \\brief  Length for Ifx_CIF_MIEP_CH_IRQ_OFFS_SHD_Bits.EP_IRQ_OFFS */
#define IFX_CIF_MIEP_CH_IRQ_OFFS_SHD_EP_IRQ_OFFS_LEN (22)

/** \\brief  Mask for Ifx_CIF_MIEP_CH_IRQ_OFFS_SHD_Bits.EP_IRQ_OFFS */
#define IFX_CIF_MIEP_CH_IRQ_OFFS_SHD_EP_IRQ_OFFS_MSK (0x3fffff)

/** \\brief  Offset for Ifx_CIF_MIEP_CH_IRQ_OFFS_SHD_Bits.EP_IRQ_OFFS */
#define IFX_CIF_MIEP_CH_IRQ_OFFS_SHD_EP_IRQ_OFFS_OFF (2)

/** \\brief  Length for Ifx_CIF_MIEP_CH_IRQ_OFFS_SHD_Bits.FIXED_TO_00 */
#define IFX_CIF_MIEP_CH_IRQ_OFFS_SHD_FIXED_TO_00_LEN (2)

/** \\brief  Mask for Ifx_CIF_MIEP_CH_IRQ_OFFS_SHD_Bits.FIXED_TO_00 */
#define IFX_CIF_MIEP_CH_IRQ_OFFS_SHD_FIXED_TO_00_MSK (0x3)

/** \\brief  Offset for Ifx_CIF_MIEP_CH_IRQ_OFFS_SHD_Bits.FIXED_TO_00 */
#define IFX_CIF_MIEP_CH_IRQ_OFFS_SHD_FIXED_TO_00_OFF (0)

/** \\brief  Length for Ifx_CIF_MIEP_CH_OFFS_CNT_INIT_Bits.EP_OFFS_CNT_INIT */
#define IFX_CIF_MIEP_CH_OFFS_CNT_INIT_EP_OFFS_CNT_INIT_LEN (22)

/** \\brief  Mask for Ifx_CIF_MIEP_CH_OFFS_CNT_INIT_Bits.EP_OFFS_CNT_INIT */
#define IFX_CIF_MIEP_CH_OFFS_CNT_INIT_EP_OFFS_CNT_INIT_MSK (0x3fffff)

/** \\brief  Offset for Ifx_CIF_MIEP_CH_OFFS_CNT_INIT_Bits.EP_OFFS_CNT_INIT */
#define IFX_CIF_MIEP_CH_OFFS_CNT_INIT_EP_OFFS_CNT_INIT_OFF (2)

/** \\brief  Length for Ifx_CIF_MIEP_CH_OFFS_CNT_INIT_Bits.FIXED_TO_00 */
#define IFX_CIF_MIEP_CH_OFFS_CNT_INIT_FIXED_TO_00_LEN (2)

/** \\brief  Mask for Ifx_CIF_MIEP_CH_OFFS_CNT_INIT_Bits.FIXED_TO_00 */
#define IFX_CIF_MIEP_CH_OFFS_CNT_INIT_FIXED_TO_00_MSK (0x3)

/** \\brief  Offset for Ifx_CIF_MIEP_CH_OFFS_CNT_INIT_Bits.FIXED_TO_00 */
#define IFX_CIF_MIEP_CH_OFFS_CNT_INIT_FIXED_TO_00_OFF (0)

/** \\brief  Length for Ifx_CIF_MIEP_CH_OFFS_CNT_SHD_Bits.EP_OFFS_CNT */
#define IFX_CIF_MIEP_CH_OFFS_CNT_SHD_EP_OFFS_CNT_LEN (22)

/** \\brief  Mask for Ifx_CIF_MIEP_CH_OFFS_CNT_SHD_Bits.EP_OFFS_CNT */
#define IFX_CIF_MIEP_CH_OFFS_CNT_SHD_EP_OFFS_CNT_MSK (0x3fffff)

/** \\brief  Offset for Ifx_CIF_MIEP_CH_OFFS_CNT_SHD_Bits.EP_OFFS_CNT */
#define IFX_CIF_MIEP_CH_OFFS_CNT_SHD_EP_OFFS_CNT_OFF (2)

/** \\brief  Length for Ifx_CIF_MIEP_CH_OFFS_CNT_SHD_Bits.FIXED_TO_00 */
#define IFX_CIF_MIEP_CH_OFFS_CNT_SHD_FIXED_TO_00_LEN (2)

/** \\brief  Mask for Ifx_CIF_MIEP_CH_OFFS_CNT_SHD_Bits.FIXED_TO_00 */
#define IFX_CIF_MIEP_CH_OFFS_CNT_SHD_FIXED_TO_00_MSK (0x3)

/** \\brief  Offset for Ifx_CIF_MIEP_CH_OFFS_CNT_SHD_Bits.FIXED_TO_00 */
#define IFX_CIF_MIEP_CH_OFFS_CNT_SHD_FIXED_TO_00_OFF (0)

/** \\brief  Length for Ifx_CIF_MIEP_CH_OFFS_CNT_START_Bits.EP_OFFS_CNT_START */
#define IFX_CIF_MIEP_CH_OFFS_CNT_START_EP_OFFS_CNT_START_LEN (22)

/** \\brief  Mask for Ifx_CIF_MIEP_CH_OFFS_CNT_START_Bits.EP_OFFS_CNT_START */
#define IFX_CIF_MIEP_CH_OFFS_CNT_START_EP_OFFS_CNT_START_MSK (0x3fffff)

/** \\brief  Offset for Ifx_CIF_MIEP_CH_OFFS_CNT_START_Bits.EP_OFFS_CNT_START */
#define IFX_CIF_MIEP_CH_OFFS_CNT_START_EP_OFFS_CNT_START_OFF (2)

/** \\brief  Length for Ifx_CIF_MIEP_CH_OFFS_CNT_START_Bits.FIXED_TO_00 */
#define IFX_CIF_MIEP_CH_OFFS_CNT_START_FIXED_TO_00_LEN (2)

/** \\brief  Mask for Ifx_CIF_MIEP_CH_OFFS_CNT_START_Bits.FIXED_TO_00 */
#define IFX_CIF_MIEP_CH_OFFS_CNT_START_FIXED_TO_00_MSK (0x3)

/** \\brief  Offset for Ifx_CIF_MIEP_CH_OFFS_CNT_START_Bits.FIXED_TO_00 */
#define IFX_CIF_MIEP_CH_OFFS_CNT_START_FIXED_TO_00_OFF (0)

/** \\brief  Length for Ifx_CIF_MIEP_CH_SIZE_INIT_Bits.EP_SIZE_INIT */
#define IFX_CIF_MIEP_CH_SIZE_INIT_EP_SIZE_INIT_LEN (22)

