keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCif_bf.h
/** \\brief  Mask for Ifx_CIF_MIEP_CH_SIZE_INIT_Bits.EP_SIZE_INIT */
#define IFX_CIF_MIEP_CH_SIZE_INIT_EP_SIZE_INIT_MSK (0x3fffff)

/** \\brief  Offset for Ifx_CIF_MIEP_CH_SIZE_INIT_Bits.EP_SIZE_INIT */
#define IFX_CIF_MIEP_CH_SIZE_INIT_EP_SIZE_INIT_OFF (2)

/** \\brief  Length for Ifx_CIF_MIEP_CH_SIZE_INIT_Bits.FIXED_TO_00 */
#define IFX_CIF_MIEP_CH_SIZE_INIT_FIXED_TO_00_LEN (2)

/** \\brief  Mask for Ifx_CIF_MIEP_CH_SIZE_INIT_Bits.FIXED_TO_00 */
#define IFX_CIF_MIEP_CH_SIZE_INIT_FIXED_TO_00_MSK (0x3)

/** \\brief  Offset for Ifx_CIF_MIEP_CH_SIZE_INIT_Bits.FIXED_TO_00 */
#define IFX_CIF_MIEP_CH_SIZE_INIT_FIXED_TO_00_OFF (0)

/** \\brief  Length for Ifx_CIF_MIEP_CH_SIZE_SHD_Bits.EP_SIZE */
#define IFX_CIF_MIEP_CH_SIZE_SHD_EP_SIZE_LEN (22)

/** \\brief  Mask for Ifx_CIF_MIEP_CH_SIZE_SHD_Bits.EP_SIZE */
#define IFX_CIF_MIEP_CH_SIZE_SHD_EP_SIZE_MSK (0x3fffff)

/** \\brief  Offset for Ifx_CIF_MIEP_CH_SIZE_SHD_Bits.EP_SIZE */
#define IFX_CIF_MIEP_CH_SIZE_SHD_EP_SIZE_OFF (2)

/** \\brief  Length for Ifx_CIF_MIEP_CH_SIZE_SHD_Bits.FIXED_TO_00 */
#define IFX_CIF_MIEP_CH_SIZE_SHD_FIXED_TO_00_LEN (2)

/** \\brief  Mask for Ifx_CIF_MIEP_CH_SIZE_SHD_Bits.FIXED_TO_00 */
#define IFX_CIF_MIEP_CH_SIZE_SHD_FIXED_TO_00_MSK (0x3)

/** \\brief  Offset for Ifx_CIF_MIEP_CH_SIZE_SHD_Bits.FIXED_TO_00 */
#define IFX_CIF_MIEP_CH_SIZE_SHD_FIXED_TO_00_OFF (0)

/** \\brief  Length for Ifx_CIF_MIEP_ICR_Bits.FILL_EP_1 */
#define IFX_CIF_MIEP_ICR_FILL_EP_1_LEN (1)

/** \\brief  Mask for Ifx_CIF_MIEP_ICR_Bits.FILL_EP_1 */
#define IFX_CIF_MIEP_ICR_FILL_EP_1_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MIEP_ICR_Bits.FILL_EP_1 */
#define IFX_CIF_MIEP_ICR_FILL_EP_1_OFF (1)

/** \\brief  Length for Ifx_CIF_MIEP_ICR_Bits.FILL_EP_2 */
#define IFX_CIF_MIEP_ICR_FILL_EP_2_LEN (1)

/** \\brief  Mask for Ifx_CIF_MIEP_ICR_Bits.FILL_EP_2 */
#define IFX_CIF_MIEP_ICR_FILL_EP_2_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MIEP_ICR_Bits.FILL_EP_2 */
#define IFX_CIF_MIEP_ICR_FILL_EP_2_OFF (5)

/** \\brief  Length for Ifx_CIF_MIEP_ICR_Bits.FILL_EP_3 */
#define IFX_CIF_MIEP_ICR_FILL_EP_3_LEN (1)

/** \\brief  Mask for Ifx_CIF_MIEP_ICR_Bits.FILL_EP_3 */
#define IFX_CIF_MIEP_ICR_FILL_EP_3_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MIEP_ICR_Bits.FILL_EP_3 */
#define IFX_CIF_MIEP_ICR_FILL_EP_3_OFF (9)

/** \\brief  Length for Ifx_CIF_MIEP_ICR_Bits.FILL_EP_4 */
#define IFX_CIF_MIEP_ICR_FILL_EP_4_LEN (1)

/** \\brief  Mask for Ifx_CIF_MIEP_ICR_Bits.FILL_EP_4 */
#define IFX_CIF_MIEP_ICR_FILL_EP_4_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MIEP_ICR_Bits.FILL_EP_4 */
#define IFX_CIF_MIEP_ICR_FILL_EP_4_OFF (13)

/** \\brief  Length for Ifx_CIF_MIEP_ICR_Bits.FILL_EP_5 */
#define IFX_CIF_MIEP_ICR_FILL_EP_5_LEN (1)

/** \\brief  Mask for Ifx_CIF_MIEP_ICR_Bits.FILL_EP_5 */
#define IFX_CIF_MIEP_ICR_FILL_EP_5_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MIEP_ICR_Bits.FILL_EP_5 */
#define IFX_CIF_MIEP_ICR_FILL_EP_5_OFF (17)

/** \\brief  Length for Ifx_CIF_MIEP_ICR_Bits.FRAME_END_EP_1 */
#define IFX_CIF_MIEP_ICR_FRAME_END_EP_1_LEN (1)

/** \\brief  Mask for Ifx_CIF_MIEP_ICR_Bits.FRAME_END_EP_1 */
#define IFX_CIF_MIEP_ICR_FRAME_END_EP_1_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MIEP_ICR_Bits.FRAME_END_EP_1 */
#define IFX_CIF_MIEP_ICR_FRAME_END_EP_1_OFF (0)

/** \\brief  Length for Ifx_CIF_MIEP_ICR_Bits.FRAME_END_EP_2 */
#define IFX_CIF_MIEP_ICR_FRAME_END_EP_2_LEN (1)

/** \\brief  Mask for Ifx_CIF_MIEP_ICR_Bits.FRAME_END_EP_2 */
#define IFX_CIF_MIEP_ICR_FRAME_END_EP_2_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MIEP_ICR_Bits.FRAME_END_EP_2 */
#define IFX_CIF_MIEP_ICR_FRAME_END_EP_2_OFF (4)

/** \\brief  Length for Ifx_CIF_MIEP_ICR_Bits.FRAME_END_EP_3 */
#define IFX_CIF_MIEP_ICR_FRAME_END_EP_3_LEN (1)

/** \\brief  Mask for Ifx_CIF_MIEP_ICR_Bits.FRAME_END_EP_3 */
#define IFX_CIF_MIEP_ICR_FRAME_END_EP_3_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MIEP_ICR_Bits.FRAME_END_EP_3 */
#define IFX_CIF_MIEP_ICR_FRAME_END_EP_3_OFF (8)

/** \\brief  Length for Ifx_CIF_MIEP_ICR_Bits.FRAME_END_EP_4 */
#define IFX_CIF_MIEP_ICR_FRAME_END_EP_4_LEN (1)

/** \\brief  Mask for Ifx_CIF_MIEP_ICR_Bits.FRAME_END_EP_4 */
#define IFX_CIF_MIEP_ICR_FRAME_END_EP_4_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MIEP_ICR_Bits.FRAME_END_EP_4 */
#define IFX_CIF_MIEP_ICR_FRAME_END_EP_4_OFF (12)

/** \\brief  Length for Ifx_CIF_MIEP_ICR_Bits.FRAME_END_EP_5 */
#define IFX_CIF_MIEP_ICR_FRAME_END_EP_5_LEN (1)

/** \\brief  Mask for Ifx_CIF_MIEP_ICR_Bits.FRAME_END_EP_5 */
#define IFX_CIF_MIEP_ICR_FRAME_END_EP_5_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MIEP_ICR_Bits.FRAME_END_EP_5 */
#define IFX_CIF_MIEP_ICR_FRAME_END_EP_5_OFF (16)

/** \\brief  Length for Ifx_CIF_MIEP_ICR_Bits.MBLK_LINE_EP_1 */
#define IFX_CIF_MIEP_ICR_MBLK_LINE_EP_1_LEN (1)

/** \\brief  Mask for Ifx_CIF_MIEP_ICR_Bits.MBLK_LINE_EP_1 */
#define IFX_CIF_MIEP_ICR_MBLK_LINE_EP_1_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MIEP_ICR_Bits.MBLK_LINE_EP_1 */
#define IFX_CIF_MIEP_ICR_MBLK_LINE_EP_1_OFF (3)

/** \\brief  Length for Ifx_CIF_MIEP_ICR_Bits.MBLK_LINE_EP_3 */
#define IFX_CIF_MIEP_ICR_MBLK_LINE_EP_3_LEN (1)

/** \\brief  Mask for Ifx_CIF_MIEP_ICR_Bits.MBLK_LINE_EP_3 */
#define IFX_CIF_MIEP_ICR_MBLK_LINE_EP_3_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MIEP_ICR_Bits.MBLK_LINE_EP_3 */
#define IFX_CIF_MIEP_ICR_MBLK_LINE_EP_3_OFF (11)

/** \\brief  Length for Ifx_CIF_MIEP_ICR_Bits.MBLK_LINE_EP_4 */
#define IFX_CIF_MIEP_ICR_MBLK_LINE_EP_4_LEN (1)

/** \\brief  Mask for Ifx_CIF_MIEP_ICR_Bits.MBLK_LINE_EP_4 */
#define IFX_CIF_MIEP_ICR_MBLK_LINE_EP_4_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MIEP_ICR_Bits.MBLK_LINE_EP_4 */
#define IFX_CIF_MIEP_ICR_MBLK_LINE_EP_4_OFF (15)

/** \\brief  Length for Ifx_CIF_MIEP_ICR_Bits.MBLK_LINE_EP_5 */
#define IFX_CIF_MIEP_ICR_MBLK_LINE_EP_5_LEN (1)

/** \\brief  Mask for Ifx_CIF_MIEP_ICR_Bits.MBLK_LINE_EP_5 */
#define IFX_CIF_MIEP_ICR_MBLK_LINE_EP_5_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MIEP_ICR_Bits.MBLK_LINE_EP_5 */
#define IFX_CIF_MIEP_ICR_MBLK_LINE_EP_5_OFF (19)

/** \\brief  Length for Ifx_CIF_MIEP_ICR_Bits.WRAP_EP_1 */
#define IFX_CIF_MIEP_ICR_WRAP_EP_1_LEN (1)

/** \\brief  Mask for Ifx_CIF_MIEP_ICR_Bits.WRAP_EP_1 */
#define IFX_CIF_MIEP_ICR_WRAP_EP_1_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MIEP_ICR_Bits.WRAP_EP_1 */
#define IFX_CIF_MIEP_ICR_WRAP_EP_1_OFF (2)

/** \\brief  Length for Ifx_CIF_MIEP_ICR_Bits.WRAP_EP_2 */
#define IFX_CIF_MIEP_ICR_WRAP_EP_2_LEN (1)

/** \\brief  Mask for Ifx_CIF_MIEP_ICR_Bits.WRAP_EP_2 */
#define IFX_CIF_MIEP_ICR_WRAP_EP_2_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MIEP_ICR_Bits.WRAP_EP_2 */
#define IFX_CIF_MIEP_ICR_WRAP_EP_2_OFF (6)

