keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxCif_bf.h
/** \\brief  Mask for Ifx_CIF_MIEP_RIS_Bits.MBLK_LINE_EP_1 */
#define IFX_CIF_MIEP_RIS_MBLK_LINE_EP_1_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MIEP_RIS_Bits.MBLK_LINE_EP_1 */
#define IFX_CIF_MIEP_RIS_MBLK_LINE_EP_1_OFF (3)

/** \\brief  Length for Ifx_CIF_MIEP_RIS_Bits.MBLK_LINE_EP_2 */
#define IFX_CIF_MIEP_RIS_MBLK_LINE_EP_2_LEN (1)

/** \\brief  Mask for Ifx_CIF_MIEP_RIS_Bits.MBLK_LINE_EP_2 */
#define IFX_CIF_MIEP_RIS_MBLK_LINE_EP_2_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MIEP_RIS_Bits.MBLK_LINE_EP_2 */
#define IFX_CIF_MIEP_RIS_MBLK_LINE_EP_2_OFF (7)

/** \\brief  Length for Ifx_CIF_MIEP_RIS_Bits.MBLK_LINE_EP_3 */
#define IFX_CIF_MIEP_RIS_MBLK_LINE_EP_3_LEN (1)

/** \\brief  Mask for Ifx_CIF_MIEP_RIS_Bits.MBLK_LINE_EP_3 */
#define IFX_CIF_MIEP_RIS_MBLK_LINE_EP_3_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MIEP_RIS_Bits.MBLK_LINE_EP_3 */
#define IFX_CIF_MIEP_RIS_MBLK_LINE_EP_3_OFF (11)

/** \\brief  Length for Ifx_CIF_MIEP_RIS_Bits.MBLK_LINE_EP_4 */
#define IFX_CIF_MIEP_RIS_MBLK_LINE_EP_4_LEN (1)

/** \\brief  Mask for Ifx_CIF_MIEP_RIS_Bits.MBLK_LINE_EP_4 */
#define IFX_CIF_MIEP_RIS_MBLK_LINE_EP_4_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MIEP_RIS_Bits.MBLK_LINE_EP_4 */
#define IFX_CIF_MIEP_RIS_MBLK_LINE_EP_4_OFF (15)

/** \\brief  Length for Ifx_CIF_MIEP_RIS_Bits.MBLK_LINE_EP_5 */
#define IFX_CIF_MIEP_RIS_MBLK_LINE_EP_5_LEN (1)

/** \\brief  Mask for Ifx_CIF_MIEP_RIS_Bits.MBLK_LINE_EP_5 */
#define IFX_CIF_MIEP_RIS_MBLK_LINE_EP_5_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MIEP_RIS_Bits.MBLK_LINE_EP_5 */
#define IFX_CIF_MIEP_RIS_MBLK_LINE_EP_5_OFF (19)

/** \\brief  Length for Ifx_CIF_MIEP_RIS_Bits.WRAP_EP_1 */
#define IFX_CIF_MIEP_RIS_WRAP_EP_1_LEN (1)

/** \\brief  Mask for Ifx_CIF_MIEP_RIS_Bits.WRAP_EP_1 */
#define IFX_CIF_MIEP_RIS_WRAP_EP_1_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MIEP_RIS_Bits.WRAP_EP_1 */
#define IFX_CIF_MIEP_RIS_WRAP_EP_1_OFF (2)

/** \\brief  Length for Ifx_CIF_MIEP_RIS_Bits.WRAP_EP_2 */
#define IFX_CIF_MIEP_RIS_WRAP_EP_2_LEN (1)

/** \\brief  Mask for Ifx_CIF_MIEP_RIS_Bits.WRAP_EP_2 */
#define IFX_CIF_MIEP_RIS_WRAP_EP_2_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MIEP_RIS_Bits.WRAP_EP_2 */
#define IFX_CIF_MIEP_RIS_WRAP_EP_2_OFF (6)

/** \\brief  Length for Ifx_CIF_MIEP_RIS_Bits.WRAP_EP_3 */
#define IFX_CIF_MIEP_RIS_WRAP_EP_3_LEN (1)

/** \\brief  Mask for Ifx_CIF_MIEP_RIS_Bits.WRAP_EP_3 */
#define IFX_CIF_MIEP_RIS_WRAP_EP_3_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MIEP_RIS_Bits.WRAP_EP_3 */
#define IFX_CIF_MIEP_RIS_WRAP_EP_3_OFF (10)

/** \\brief  Length for Ifx_CIF_MIEP_RIS_Bits.WRAP_EP_4 */
#define IFX_CIF_MIEP_RIS_WRAP_EP_4_LEN (1)

/** \\brief  Mask for Ifx_CIF_MIEP_RIS_Bits.WRAP_EP_4 */
#define IFX_CIF_MIEP_RIS_WRAP_EP_4_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MIEP_RIS_Bits.WRAP_EP_4 */
#define IFX_CIF_MIEP_RIS_WRAP_EP_4_OFF (14)

/** \\brief  Length for Ifx_CIF_MIEP_RIS_Bits.WRAP_EP_5 */
#define IFX_CIF_MIEP_RIS_WRAP_EP_5_LEN (1)

/** \\brief  Mask for Ifx_CIF_MIEP_RIS_Bits.WRAP_EP_5 */
#define IFX_CIF_MIEP_RIS_WRAP_EP_5_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MIEP_RIS_Bits.WRAP_EP_5 */
#define IFX_CIF_MIEP_RIS_WRAP_EP_5_OFF (18)

/** \\brief  Length for Ifx_CIF_MIEP_STA_ERR_CLR_Bits.EP_1_IC_SIZE_ERR_CLR */
#define IFX_CIF_MIEP_STA_ERR_CLR_EP_1_IC_SIZE_ERR_CLR_LEN (1)

/** \\brief  Mask for Ifx_CIF_MIEP_STA_ERR_CLR_Bits.EP_1_IC_SIZE_ERR_CLR */
#define IFX_CIF_MIEP_STA_ERR_CLR_EP_1_IC_SIZE_ERR_CLR_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MIEP_STA_ERR_CLR_Bits.EP_1_IC_SIZE_ERR_CLR */
#define IFX_CIF_MIEP_STA_ERR_CLR_EP_1_IC_SIZE_ERR_CLR_OFF (1)

/** \\brief  Length for Ifx_CIF_MIEP_STA_ERR_CLR_Bits.EP_2_IC_SIZE_ERR_CLR */
#define IFX_CIF_MIEP_STA_ERR_CLR_EP_2_IC_SIZE_ERR_CLR_LEN (1)

/** \\brief  Mask for Ifx_CIF_MIEP_STA_ERR_CLR_Bits.EP_2_IC_SIZE_ERR_CLR */
#define IFX_CIF_MIEP_STA_ERR_CLR_EP_2_IC_SIZE_ERR_CLR_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MIEP_STA_ERR_CLR_Bits.EP_2_IC_SIZE_ERR_CLR */
#define IFX_CIF_MIEP_STA_ERR_CLR_EP_2_IC_SIZE_ERR_CLR_OFF (2)

/** \\brief  Length for Ifx_CIF_MIEP_STA_ERR_CLR_Bits.EP_3_IC_SIZE_ERR_CLR */
#define IFX_CIF_MIEP_STA_ERR_CLR_EP_3_IC_SIZE_ERR_CLR_LEN (1)

/** \\brief  Mask for Ifx_CIF_MIEP_STA_ERR_CLR_Bits.EP_3_IC_SIZE_ERR_CLR */
#define IFX_CIF_MIEP_STA_ERR_CLR_EP_3_IC_SIZE_ERR_CLR_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MIEP_STA_ERR_CLR_Bits.EP_3_IC_SIZE_ERR_CLR */
#define IFX_CIF_MIEP_STA_ERR_CLR_EP_3_IC_SIZE_ERR_CLR_OFF (3)

/** \\brief  Length for Ifx_CIF_MIEP_STA_ERR_CLR_Bits.EP_4_IC_SIZE_ERR_CLR */
#define IFX_CIF_MIEP_STA_ERR_CLR_EP_4_IC_SIZE_ERR_CLR_LEN (1)

/** \\brief  Mask for Ifx_CIF_MIEP_STA_ERR_CLR_Bits.EP_4_IC_SIZE_ERR_CLR */
#define IFX_CIF_MIEP_STA_ERR_CLR_EP_4_IC_SIZE_ERR_CLR_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MIEP_STA_ERR_CLR_Bits.EP_4_IC_SIZE_ERR_CLR */
#define IFX_CIF_MIEP_STA_ERR_CLR_EP_4_IC_SIZE_ERR_CLR_OFF (4)

/** \\brief  Length for Ifx_CIF_MIEP_STA_ERR_CLR_Bits.EP_5_IC_SIZE_ERR_CLR */
#define IFX_CIF_MIEP_STA_ERR_CLR_EP_5_IC_SIZE_ERR_CLR_LEN (1)

/** \\brief  Mask for Ifx_CIF_MIEP_STA_ERR_CLR_Bits.EP_5_IC_SIZE_ERR_CLR */
#define IFX_CIF_MIEP_STA_ERR_CLR_EP_5_IC_SIZE_ERR_CLR_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MIEP_STA_ERR_CLR_Bits.EP_5_IC_SIZE_ERR_CLR */
#define IFX_CIF_MIEP_STA_ERR_CLR_EP_5_IC_SIZE_ERR_CLR_OFF (5)

/** \\brief  Length for Ifx_CIF_MIEP_STA_ERR_Bits.EP_1_FIFO_FULL */
#define IFX_CIF_MIEP_STA_ERR_EP_1_FIFO_FULL_LEN (1)

/** \\brief  Mask for Ifx_CIF_MIEP_STA_ERR_Bits.EP_1_FIFO_FULL */
#define IFX_CIF_MIEP_STA_ERR_EP_1_FIFO_FULL_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MIEP_STA_ERR_Bits.EP_1_FIFO_FULL */
#define IFX_CIF_MIEP_STA_ERR_EP_1_FIFO_FULL_OFF (17)

/** \\brief  Length for Ifx_CIF_MIEP_STA_ERR_Bits.EP_1_IC_SIZE_ERR */
#define IFX_CIF_MIEP_STA_ERR_EP_1_IC_SIZE_ERR_LEN (1)

/** \\brief  Mask for Ifx_CIF_MIEP_STA_ERR_Bits.EP_1_IC_SIZE_ERR */
#define IFX_CIF_MIEP_STA_ERR_EP_1_IC_SIZE_ERR_MSK (0x1)

/** \\brief  Offset for Ifx_CIF_MIEP_STA_ERR_Bits.EP_1_IC_SIZE_ERR */
#define IFX_CIF_MIEP_STA_ERR_EP_1_IC_SIZE_ERR_OFF (1)

/** \\brief  Length for Ifx_CIF_MIEP_STA_ERR_Bits.EP_2_FIFO_FULL */
#define IFX_CIF_MIEP_STA_ERR_EP_2_FIFO_FULL_LEN (1)

